{
    "<pad>": 0,
    "<unk>": 1,
    "<s>": 2,
    "</s>": 3,
    "a": 4,
    "_": 5,
    "n": 6,
    "r": 7,
    "e": 8,
    "o": 9,
    "v": 10,
    "i": 11,
    "t": 12,
    "y": 13,
    "k": 14,
    "s": 15,
    "h": 16,
    "m": 17,
    "w": 18,
    "l": 19,
    "d": 20,
    "j": 21,
    "g": 22,
    "c": 23,
    "p": 24,
    ",": 25,
    "b": 26,
    "1": 27,
    "z": 28,
    "-": 29,
    ".": 30,
    "x": 31,
    "0": 32,
    "A": 33,
    "2": 34,
    ":": 35,
    "9": 36,
    "q": 37,
    "@": 38,
    "4": 39,
    "3": 40,
    "(": 41,
    "S": 42,
    ")": 43,
    "H": 44,
    "8": 45,
    "M": 46,
    "5": 47,
    "7": 48,
    "&": 49,
    "6": 50,
    "f": 51,
    "P": 52,
    "T": 53,
    "G": 54,
    "N": 55,
    "I": 56,
    "K": 57,
    "D": 58,
    "E": 59,
    "`": 60,
    "L": 61,
    "C": 62,
    "«": 63,
    "»": 64,
    "B": 65,
    "O": 66,
    "u": 67,
    "F": 68,
    "R": 69,
    "V": 70,
    "=": 71,
    "}": 72,
    "{": 73,
    "W": 74,
    "Y": 75,
    "и": 76,
    "\\": 77,
    "а": 78,
    "о": 79,
    "J": 80,
    "е": 81,
    "/": 82,
    "н": 83,
    "X": 84,
    "р": 85,
    "с": 86,
    "—": 87,
    "т": 88,
    "+": 89,
    "Z": 90,
    "–": 91,
    "к": 92,
    "в": 93,
    "л": 94,
    "°": 95,
    "Q": 96,
    "м": 97,
    "д": 98,
    "\"": 99,
    "я": 100,
    "й": 101,
    "U": 102,
    "%": 103,
    "у": 104,
    "п": 105,
    ";": 106,
    "г": 107,
    "'": 108,
    "−": 109,
    "ы": 110,
    "ь": 111,
    "М": 112,
    "ч": 113,
    "С": 114,
    "з": 115,
    "б": 116,
    "!": 117,
    "х": 118,
    "֊": 119,
    "^": 120,
    "А": 121,
    "]": 122,
    "[": 123,
    "ц": 124,
    "*": 125,
    "В": 126,
    "И": 127,
    "П": 128,
    "К": 129,
    "ф": 130,
    ">": 131,
    "<": 132,
    "Р": 133,
    "’": 134,
    "О": 135,
    "⋅": 136,
    "Б": 137,
    "Н": 138,
    "ш": 139,
    "$": 140,
    "Г": 141,
    "?": 142,
    "ж": 143,
    "→": 144,
    "Д": 145,
    "Т": 146,
    "é": 147,
    "π": 148,
    "α": 149,
    "э": 150,
    "Л": 151,
    "½": 152,
    "…": 153,
    "|": 154,
    "ا": 155,
    "ю": 156,
    "‎": 157,
    "Е": 158,
    "~": 159,
    "Х": 160,
    "Ф": 161,
    "У": 162,
    "Э": 163,
    "​": 164,
    "ل": 165,
    "#": 166,
    "щ": 167,
    "β": 168,
    "ː": 169,
    "ü": 170,
    "∈": 171,
    "×": 172,
    "№": 173,
    "è": 174,
    "∞": 175,
    "З": 176,
    "↑": 177,
    "²": 178,
    "і": 179,
    "′": 180,
    "ν": 181,
    "⟶": 182,
    "ი": 183,
    "ε": 184,
    "م": 185,
    "ر": 186,
    "á": 187,
    "“": 188,
    "ä": 189,
    "ن": 190,
    "ó": 191,
    "ι": 192,
    "”": 193,
    "ي": 194,
    "γ": 195,
    "±": 196,
    "ع": 197,
    "ö": 198,
    "í": 199,
    "Ш": 200,
    "Ч": 201,
    "ب": 202,
    "ё": 203,
    "Я": 204,
    "ο": 205,
    "≈": 206,
    "λ": 207,
    "ა": 208,
    "ς": 209,
    "ン": 210,
    "د": 211,
    "ー": 212,
    "″": 213,
    "‘": 214,
    "و": 215,
    "Ю": 216,
    "•": 217,
    "ρ": 218,
    "⋯": 219,
    "κ": 220,
    "τ": 221,
    "­": 222,
    "≠": 223,
    "Δ": 224,
    "∀": 225,
    "∑": 226,
    "ე": 227,
    "Ц": 228,
    "ї": 229,
    "φ": 230,
    "δ": 231,
    "ˈ": 232,
    "⩽": 233,
    "ح": 234,
    "ί": 235,
    "س": 236,
    "σ": 237,
    "ლ": 238,
    "η": 239,
    "æ": 240,
    "ə": 241,
    "·": 242,
    "י": 243,
    "∗": 244,
    "ة": 245,
    "ו": 246,
    "ω": 247,
    "ā": 248,
    "É": 249,
    "₪": 250,
    "ت": 251,
    "́": 252,
    "・": 253,
    "⁡": 254,
    "の": 255,
    "أ": 256,
    "ר": 257,
    "∃": 258,
    "―": 259,
    "რ": 260,
    "ע": 261,
    "θ": 262,
    "ル": 263,
    "ラ": 264,
    "ف": 265,
    "Ä": 266,
    "¯": 267,
    "⊂": 268,
    "ל": 269,
    "ъ": 270,
    "μ": 271,
    "ά": 272,
    "ß": 273,
    "ロ": 274,
    "ス": 275,
    "ვ": 276,
    "ی": 277,
    "ك": 278,
    "ή": 279,
    "Ν": 280,
    "ɪ": 281,
    "ō": 282,
    "ç": 283,
    "⁄": 284,
    "ო": 285,
    "ნ": 286,
    "א": 287,
    "ּ": 288,
    "υ": 289,
    "à": 290,
    "ه": 291,
    "ה": 292,
    "Ж": 293,
    "ú": 294,
    "ñ": 295,
    "ャ": 296,
    "マ": 297,
    "ィ": 298,
    "ん": 299,
    "გ": 300,
    "ق": 301,
    "ص": 302,
    "ת": 303,
    "ı": 304,
    "â": 305,
    "³": 306,
    "キ": 307,
    "ش": 308,
    "ز": 309,
    "έ": 310,
    "ū": 311,
    "¢": 312,
    "リ": 313,
    "ト": 314,
    "ッ": 315,
    "コ": 316,
    "ク": 317,
    "⏟": 318,
    "ש": 319,
    "ό": 320,
    "ɑ": 321,
    "ë": 322,
    "£": 323,
    "ジ": 324,
    "⇒": 325,
    "خ": 326,
    "ī": 327,
    "中": 328,
    "イ": 329,
    "≡": 330,
    "ℏ": 331,
    "„": 332,
    "დ": 333,
    "ֹ": 334,
    "ִ": 335,
    "Α": 336,
    "ğ": 337,
    "ð": 338,
    "ベ": 339,
    "フ": 340,
    "ド": 341,
    "シ": 342,
    "⨀": 343,
    "‚": 344,
    "ძ": 345,
    "შ": 346,
    "ს": 347,
    "ბ": 348,
    "َ": 349,
    "є": 350,
    "І": 351,
    "ē": 352,
    "ă": 353,
    "¿": 354,
    "©": 355,
    "国": 356,
    "ョ": 357,
    "モ": 358,
    "ミ": 359,
    "デ": 360,
    "ゴ": 361,
    "ア": 362,
    "⩾": 363,
    "⟩": 364,
    "⟨": 365,
    "∧": 366,
    "‰": 367,
    "კ": 368,
    "თ": 369,
    "ח": 370,
    "ב": 371,
    "ָ": 372,
    "ַ": 373,
    "ʊ": 374,
    "¡": 375,
    "스": 376,
    "女": 377,
    "プ": 378,
    "ニ": 379,
    "タ": 380,
    "グ": 381,
    "か": 382,
    "⏞": 383,
    "∨": 384,
    "‱": 385,
    "غ": 386,
    "ض": 387,
    "ج": 388,
    "ء": 389,
    "מ": 390,
    "ד": 391,
    "ώ": 392,
    "χ": 393,
    "ζ": 394,
    "Σ": 395,
    "Π": 396,
    "ˌ": 397,
    "ʔ": 398,
    "ɛ": 399,
    "÷": 400,
    "ì": 401,
    "ê": 402,
    "키": 403,
    "魔": 404,
    "海": 405,
    "大": 406,
    "テ": 407,
    "ダ": 408,
    "カ": 409,
    "ウ": 410,
    "ら": 411,
    "い": 412,
    "⋱": 413,
    "≥": 414,
    "∣": 415,
    "∘": 416,
    "य": 417,
    "ׁ": 418,
    "ֶ": 419,
    "ְ": 420,
    "Ә": 421,
    "Ы": 422,
    "Й": 423,
    "Ο": 424,
    "Κ": 425,
    "Ε": 426,
    "ł": 427,
    "´": 428,
    "§": 429,
    "유": 430,
    "나": 431,
    "轉": 432,
    "王": 433,
    "法": 434,
    "天": 435,
    "下": 436,
    "ュ": 437,
    "ム": 438,
    "ピ": 439,
    "ビ": 440,
    "ナ": 441,
    "オ": 442,
    "げ": 443,
    "」": 444,
    "「": 445,
    "∫": 446,
    "∖": 447,
    "↓": 448,
    "ἐ": 449,
    "ἀ": 450,
    "უ": 451,
    "ٌ": 452,
    "ط": 453,
    "ן": 454,
    "ם": 455,
    "כ": 456,
    "ύ": 457,
    "Φ": 458,
    "ʕ": 459,
    "ʃ": 460,
    "š": 461,
    "ś": 462,
    "ř": 463,
    "đ": 464,
    "č": 465,
    "Ā": 466,
    "õ": 467,
    "ò": 468,
    "î": 469,
    "Ü": 470,
    "Ö": 471,
    "하": 472,
    "이": 473,
    "만": 474,
    "다": 475,
    "香": 476,
    "少": 477,
    "地": 478,
    "台": 479,
    "動": 480,
    "人": 481,
    "五": 482,
    "ユ": 483,
    "ヤ": 484,
    "チ": 485,
    "ズ": 486,
    "サ": 487,
    "ゃ": 488,
    "ま": 489,
    "ひ": 490,
    "ち": 491,
    "た": 492,
    "し": 493,
    "さ": 494,
    "き": 495,
    "⊕": 496,
    "∏": 497,
    "∅": 498,
    "†": 499,
    "‏": 500,
    "ṭ": 501,
    "ხ": 502,
    "ტ": 503,
    "მ": 504,
    "ा": 505,
    "گ": 506,
    "پ": 507,
    "ْ": 508,
    "ِ": 509,
    "ئ": 510,
    "פ": 511,
    "ג": 512,
    "ј": 513,
    "ˋ": 514,
    "ʾ": 515,
    "ʒ": 516,
    "ʌ": 517,
    "ʁ": 518,
    "ǔ": 519,
    "Ə": 520,
    "ş": 521,
    "ã": 522,
    "Õ": 523,
    "Á": 524,
    "¬": 525,
    "퍼": 526,
    "일": 527,
    "사": 528,
    "미": 529,
    "黒": 530,
    "震": 531,
    "陛": 532,
    "道": 533,
    "賊": 534,
    "空": 535,
    "真": 536,
    "盤": 537,
    "皇": 538,
    "活": 539,
    "民": 540,
    "川": 541,
    "子": 542,
    "國": 543,
    "四": 544,
    "和": 545,
    "华": 546,
    "写": 547,
    "共": 548,
    "ブ": 549,
    "バ": 550,
    "ガ": 551,
    "ァ": 552,
    "わ": 553,
    "り": 554,
    "ば": 555,
    "は": 556,
    "く": 557,
    "え": 558,
    "あ": 559,
    "▢": 560,
    "≤": 561,
    "≃": 562,
    "∪": 563,
    "⇄": 564,
    "Ⅳ": 565,
    "€": 566,
    "ế": 567,
    "წ": 568,
    "་": 569,
    "्": 570,
    "ک": 571,
    "ى": 572,
    "ק": 573,
    "צ": 574,
    "נ": 575,
    "ז": 576,
    "ՙ": 577,
    "ұ": 578,
    "ү": 579,
    "њ": 580,
    "Щ": 581,
    "Є": 582,
    "Μ": 583,
    "ˑ": 584,
    "ʻ": 585,
    "ɹ": 586,
    "ɡ": 587,
    "ș": 588,
    "İ": 589,
    "ħ": 590,
    "ę": 591,
    "ô": 592,
    "Æ": 593,
    "Å": 594,
    "Â": 595,
    "한": 596,
    "쳐": 597,
    "은": 598,
    "월": 599,
    "우": 600,
    "시": 601,
    "브": 602,
    "범": 603,
    "반": 604,
    "문": 605,
    "랑": 606,
    "라": 607,
    "뛴": 608,
    "들": 609,
    "더": 610,
    "니": 611,
    "놈": 612,
    "김": 613,
    "기": 614,
    "국": 615,
    "게": 616,
    "가": 617,
    "麦": 618,
    "雜": 619,
    "険": 620,
    "通": 621,
    "起": 622,
    "覇": 623,
    "舞": 624,
    "肇": 625,
    "科": 626,
    "田": 627,
    "灣": 628,
    "湾": 629,
    "淛": 630,
    "浜": 631,
    "河": 632,
    "沖": 633,
    "気": 634,
    "死": 635,
    "武": 636,
    "檀": 637,
    "梅": 638,
    "松": 639,
    "杂": 640,
    "木": 641,
    "暴": 642,
    "時": 643,
    "手": 644,
    "戦": 645,
    "愛": 646,
    "常": 647,
    "帝": 648,
    "市": 649,
    "巴": 650,
    "島": 651,
    "岡": 652,
    "宙": 653,
    "宇": 654,
    "太": 655,
    "士": 656,
    "城": 657,
    "原": 658,
    "北": 659,
    "冒": 660,
    "俎": 661,
    "令": 662,
    "ワ": 663,
    "レ": 664,
    "メ": 665,
    "ペ": 666,
    "パ": 667,
    "ノ": 668,
    "ソ": 669,
    "セ": 670,
    "ゲ": 671,
    "ケ": 672,
    "エ": 673,
    "ェ": 674,
    "め": 675,
    "と": 676,
    "つ": 677,
    "っ": 678,
    "せ": 679,
    "じ": 680,
    "け": 681,
    "う": 682,
    "⌣": 683,
    "⌢": 684,
    "⋮": 685,
    "∼": 686,
    "∠": 687,
    "∙": 688,
    "←": 689,
    "⅓": 690,
    "₥": 691,
    "›": 692,
    "‹": 693,
    "Ἐ": 694,
    "ố": 695,
    "ṇ": 696,
    "ḍ": 697,
    "ყ": 698,
    "ფ": 699,
    "პ": 700,
    "ზ": 701,
    "ေ": 702,
    "ན": 703,
    "र": 704,
    "ण": 705,
    "ड": 706,
    "च": 707,
    "ख": 708,
    "٫": 709,
    "٨": 710,
    "٣": 711,
    "ّ": 712,
    "ذ": 713,
    "إ": 714,
    "ף": 715,
    "ס": 716,
    "ט": 717,
    "ґ": 718,
    "Ґ": 719,
    "ћ": 720,
    "Ї": 721,
    "ϵ": 722,
    "ϕ": 723,
    "Τ": 724,
    "Γ": 725,
    "ˤ": 726,
    "ɦ": 727,
    "ɔ": 728,
    "ɒ": 729,
    "ǰ": 730,
    "ǒ": 731,
    "Ž": 732,
    "ű": 733,
    "ő": 734,
    "ń": 735,
    "Č": 736,
    "ø": 737,
    "Ø": 738,
    "Ó": 739,
    "Ñ": 740,
    "Í": 741,
    "Ã": 742,
    "Ｚ": 743,
    "️": 744,
    "훈": 745,
    "환": 746,
    "현": 747,
    "혁": 748,
    "피": 749,
    "프": 750,
    "표": 751,
    "펙": 752,
    "틴": 753,
    "티": 754,
    "특": 755,
    "트": 756,
    "퇴": 757,
    "친": 758,
    "창": 759,
    "찬": 760,
    "짓": 761,
    "진": 762,
    "지": 763,
    "종": 764,
    "조": 765,
    "점": 766,
    "장": 767,
    "자": 768,
    "의": 769,
    "용": 770,
    "왕": 771,
    "여": 772,
    "앨": 773,
    "앤": 774,
    "아": 775,
    "싸": 776,
    "식": 777,
    "션": 778,
    "셔": 779,
    "센": 780,
    "서": 781,
    "상": 782,
    "쁜": 783,
    "뷔": 784,
    "부": 785,
    "봐": 786,
    "본": 787,
    "별": 788,
    "백": 789,
    "발": 790,
    "민": 791,
    "록": 792,
    "로": 793,
    "람": 794,
    "떴": 795,
    "드": 796,
    "데": 797,
    "눈": 798,
    "내": 799,
    "길": 800,
    "근": 801,
    "과": 802,
    "공": 803,
    "같": 804,
    "龍": 805,
    "黄": 806,
    "黃": 807,
    "鷹": 808,
    "髪": 809,
    "風": 810,
    "青": 811,
    "集": 812,
    "隊": 813,
    "阿": 814,
    "長": 815,
    "銅": 816,
    "鈴": 817,
    "野": 818,
    "里": 819,
    "部": 820,
    "進": 821,
    "进": 822,
    "軍": 823,
    "躍": 824,
    "跃": 825,
    "超": 826,
    "赤": 827,
    "貴": 828,
    "谷": 829,
    "谢": 830,
    "謝": 831,
    "要": 832,
    "行": 833,
    "蛇": 834,
    "萩": 835,
    "華": 836,
    "菜": 837,
    "芥": 838,
    "聖": 839,
    "者": 840,
    "耀": 841,
    "美": 842,
    "网": 843,
    "络": 844,
    "组": 845,
    "縄": 846,
    "組": 847,
    "米": 848,
    "神": 849,
    "矢": 850,
    "目": 851,
    "的": 852,
    "百": 853,
    "白": 854,
    "生": 855,
    "理": 856,
    "獣": 857,
    "犬": 858,
    "版": 859,
    "港": 860,
    "洋": 861,
    "汶": 862,
    "江": 863,
    "殿": 864,
    "機": 865,
    "棒": 866,
    "桜": 867,
    "栞": 868,
    "林": 869,
    "東": 870,
    "村": 871,
    "李": 872,
    "本": 873,
    "有": 874,
    "春": 875,
    "星": 876,
    "早": 877,
    "旗": 878,
    "方": 879,
    "敏": 880,
    "承": 881,
    "忍": 882,
    "年": 883,
    "平": 884,
    "師": 885,
    "寺": 886,
    "実": 887,
    "完": 888,
    "学": 889,
    "姫": 890,
    "外": 891,
    "塞": 892,
    "場": 893,
    "報": 894,
    "団": 895,
    "团": 896,
    "味": 897,
    "君": 898,
    "司": 899,
    "千": 900,
    "十": 901,
    "医": 902,
    "匠": 903,
    "勢": 904,
    "势": 905,
    "劇": 906,
    "剣": 907,
    "兵": 908,
    "公": 909,
    "八": 910,
    "全": 911,
    "光": 912,
    "先": 913,
    "候": 914,
    "侠": 915,
    "使": 916,
    "件": 917,
    "代": 918,
    "介": 919,
    "井": 920,
    "二": 921,
    "事": 922,
    "之": 923,
    "世": 924,
    "上": 925,
    "三": 926,
    "七": 927,
    "一": 928,
    "ポ": 929,
    "ハ": 930,
    "ゾ": 931,
    "ゼ": 932,
    "る": 933,
    "や": 934,
    "も": 935,
    "む": 936,
    "み": 937,
    "へ": 938,
    "ぱ": 939,
    "で": 940,
    "だ": 941,
    "そ": 942,
    "こ": 943,
    "ぐ": 944,
    "が": 945,
    "⸘": 946,
    "⟺": 947,
    "❤": 948,
    "✌": 949,
    "☉": 950,
    "★": 951,
    "Ⓧ": 952,
    "Ⓢ": 953,
    "⋃": 954,
    "⋂": 955,
    "⋁": 956,
    "√": 957,
    "∉": 958,
    "⇀": 959,
    "↽": 960,
    "⅔": 961,
    "℗": 962,
    "℃": 963,
    "₉": 964,
    "₅": 965,
    "₄": 966,
    "₂": 967,
    "₁": 968,
    "‽": 969,
    "‒": 970,
    "‑": 971,
    "ῶ": 972,
    "ῖ": 973,
    "ὀ": 974,
    "Ἔ": 975,
    "ἕ": 976,
    "ἆ": 977,
    "ỹ": 978,
    "ệ": 979,
    "ẹ": 980,
    "ḗ": 981,
    "ታ": 982,
    "ሪ": 983,
    "ላ": 984,
    "ჯ": 985,
    "ჭ": 986,
    "ჟ": 987,
    "ှ": 988,
    "ွ": 989,
    "်": 990,
    "ာ": 991,
    "ရ": 992,
    "ည": 993,
    "င": 994,
    "ྱ": 995,
    "ྟ": 996,
    "ྒ": 997,
    "ོ": 998,
    "ི": 999,
    "ས": 1000,
    "ར": 1001,
    "འ": 1002,
    "ཛ": 1003,
    "ཚ": 1004,
    "མ": 1005,
    "བ": 1006,
    "ो": 1007,
    "े": 1008,
    "ू": 1009,
    "श": 1010,
    "न": 1011,
    "द": 1012,
    "झ": 1013,
    "क": 1014,
    "ऊ": 1015,
    "ं": 1016,
    "ܐ": 1017,
    "۹": 1018,
    "۷": 1019,
    "۱": 1020,
    "٦": 1021,
    "ُ": 1022,
    "ظ": 1023,
    "ث": 1024,
    "آ": 1025,
    "״": 1026,
    "ֵ": 1027,
    "ֲ": 1028,
    "ә": 1029,
    "ҙ": 1030,
    "ѣ": 1031,
    "Ѐ": 1032,
    "Ϩ": 1033,
    "ξ": 1034,
    "Χ": 1035,
    "Ρ": 1036,
    "Ι": 1037,
    "Θ": 1038,
    "Ζ": 1039,
    "Β": 1040,
    "Ή": 1041,
    "̯": 1042,
    "̦": 1043,
    "̄": 1044,
    "˙": 1045,
    "ʲ": 1046,
    "ɣ": 1047,
    "ǫ": 1048,
    "Ű": 1049,
    "ů": 1050,
    "ũ": 1051,
    "Ũ": 1052,
    "ţ": 1053,
    "Š": 1054,
    "Ş": 1055,
    "Œ": 1056,
    "Ő": 1057,
    "Ō": 1058,
    "ŋ": 1059,
    "Ē": 1060,
    "ć": 1061,
    "þ": 1062,
    "ý": 1063,
    "û": 1064,
    "ï": 1065,
    "À": 1066,
    "¼": 1067,
    "®": 1068
}