{
    "<pad>": 0,
    "<unk>": 1,
    "<s>": 2,
    "</s>": 3,
    "_": 4,
    "ա": 5,
    "ն": 6,
    "ր": 7,
    "ո": 8,
    "ի": 9,
    "ե": 10,
    "ւ": 11,
    "մ": 12,
    "կ": 13,
    "տ": 14,
    "յ": 15,
    "վ": 16,
    "ս": 17,
    "լ": 18,
    "թ": 19,
    "հ": 20,
    "դ": 21,
    "ց": 22,
    "գ": 23,
    "ը": 24,
    ",": 25,
    "ք": 26,
    "բ": 27,
    "պ": 28,
    "ղ": 29,
    "1": 30,
    "է": 31,
    "-": 32,
    "ծ": 33,
    "։": 34,
    "և": 35,
    "0": 36,
    "ռ": 37,
    "շ": 38,
    "զ": 39,
    "2": 40,
    "Ա": 41,
    "խ": 42,
    "9": 43,
    ".": 44,
    "ջ": 45,
    "e": 46,
    "3": 47,
    "(": 48,
    "չ": 49,
    "a": 50,
    ")": 51,
    "8": 52,
    "i": 53,
    "o": 54,
    "5": 55,
    "n": 56,
    ":": 57,
    "4": 58,
    "r": 59,
    "7": 60,
    "t": 61,
    "Մ": 62,
    "Հ": 63,
    "6": 64,
    "s": 65,
    "ժ": 66,
    "l": 67,
    "՝": 68,
    "փ": 69,
    "օ": 70,
    "Ս": 71,
    "ձ": 72,
    "ֆ": 73,
    "d": 74,
    "ճ": 75,
    "«": 76,
    "»": 77,
    "c": 78,
    "Կ": 79,
    "Գ": 80,
    "Ն": 81,
    "Բ": 82,
    "h": 83,
    "I": 84,
    "u": 85,
    "S": 86,
    "Լ": 87,
    "m": 88,
    "y": 89,
    "Դ": 90,
    "p": 91,
    "Տ": 92,
    "C": 93,
    "=": 94,
    "Պ": 95,
    "Ե": 96,
    "Ֆ": 97,
    "Վ": 98,
    "}": 99,
    "{": 100,
    "g": 101,
    "A": 102,
    "B": 103,
    "Ռ": 104,
    "Փ": 105,
    "b": 106,
    "и": 107,
    "Ծ": 108,
    "f": 109,
    "\\": 110,
    "Ի": 111,
    "а": 112,
    "о": 113,
    "N": 114,
    "M": 115,
    "P": 116,
    "H": 117,
    "Շ": 118,
    "е": 119,
    "T": 120,
    "/": 121,
    "Օ": 122,
    "Խ": 123,
    "Ո": 124,
    "Թ": 125,
    "н": 126,
    "O": 127,
    "р": 128,
    "k": 129,
    "v": 130,
    "с": 131,
    "R": 132,
    "D": 133,
    "x": 134,
    "—": 135,
    "Է": 136,
    "L": 137,
    "w": 138,
    "Ք": 139,
    "т": 140,
    "Ջ": 141,
    "V": 142,
    "F": 143,
    "+": 144,
    "Չ": 145,
    "–": 146,
    "X": 147,
    "G": 148,
    "к": 149,
    "`": 150,
    "E": 151,
    "в": 152,
    "л": 153,
    "W": 154,
    "°": 155,
    "Յ": 156,
    "Ը": 157,
    "․": 158,
    "J": 159,
    "м": 160,
    "д": 161,
    "\"": 162,
    "Զ": 163,
    "я": 164,
    "K": 165,
    "й": 166,
    "Ժ": 167,
    "U": 168,
    "%": 169,
    "z": 170,
    "у": 171,
    "п": 172,
    ";": 173,
    "г": 174,
    "'": 175,
    "−": 176,
    "Ց": 177,
    "ы": 178,
    "&": 179,
    "ь": 180,
    "М": 181,
    "q": 182,
    "ч": 183,
    "С": 184,
    "Ձ": 185,
    "Y": 186,
    "з": 187,
    "б": 188,
    "х": 189,
    "֊": 190,
    "^": 191,
    "Ճ": 192,
    "А": 193,
    "]": 194,
    "[": 195,
    "ц": 196,
    "*": 197,
    "j": 198,
    "Ղ": 199,
    "В": 200,
    "!": 201,
    "И": 202,
    "П": 203,
    "К": 204,
    "ф": 205,
    "Q": 206,
    "՛": 207,
    "Z": 208,
    ">": 209,
    "<": 210,
    "Р": 211,
    "’": 212,
    "О": 213,
    "⋅": 214,
    "Б": 215,
    "Н": 216,
    "ш": 217,
    "$": 218,
    "Г": 219,
    "ж": 220,
    "→": 221,
    "Д": 222,
    "Т": 223,
    "é": 224,
    "π": 225,
    "α": 226,
    "э": 227,
    "?": 228,
    "Л": 229,
    "½": 230,
    "…": 231,
    "|": 232,
    "ا": 233,
    "ю": 234,
    "‎": 235,
    "Е": 236,
    "~": 237,
    "Х": 238,
    "Ф": 239,
    "У": 240,
    "Э": 241,
    "Ր": 242,
    "​": 243,
    "ل": 244,
    "#": 245,
    "՞": 246,
    "щ": 247,
    "β": 248,
    "ː": 249,
    "ü": 250,
    "∈": 251,
    "×": 252,
    "№": 253,
    "è": 254,
    "∞": 255,
    "З": 256,
    "↑": 257,
    "²": 258,
    "і": 259,
    "′": 260,
    "Ւ": 261,
    "ν": 262,
    "⟶": 263,
    "ი": 264,
    "ε": 265,
    "م": 266,
    "ر": 267,
    "á": 268,
    "“": 269,
    "ä": 270,
    "ن": 271,
    "ó": 272,
    "ι": 273,
    "”": 274,
    "ي": 275,
    "γ": 276,
    "±": 277,
    "ع": 278,
    "ö": 279,
    "í": 280,
    "Ш": 281,
    "Ч": 282,
    "ب": 283,
    "ё": 284,
    "Я": 285,
    "ο": 286,
    "≈": 287,
    "λ": 288,
    "ა": 289,
    "ς": 290,
    "ン": 291,
    "د": 292,
    "ー": 293,
    "″": 294,
    "‘": 295,
    "و": 296,
    "Ю": 297,
    "•": 298,
    "ρ": 299,
    "⋯": 300,
    "κ": 301,
    "τ": 302,
    "­": 303,
    "≠": 304,
    "Δ": 305,
    "∀": 306,
    "∑": 307,
    "ე": 308,
    "Ц": 309,
    "ї": 310,
    "φ": 311,
    "δ": 312,
    "ˈ": 313,
    "⩽": 314,
    "ح": 315,
    "ί": 316,
    "س": 317,
    "σ": 318,
    "ლ": 319,
    "η": 320,
    "æ": 321,
    "ə": 322,
    "·": 323,
    "י": 324,
    "∗": 325,
    "ة": 326,
    "ו": 327,
    "ω": 328,
    "ā": 329,
    "É": 330,
    "₪": 331,
    "ت": 332,
    "́": 333,
    "・": 334,
    "⁡": 335,
    "՜": 336,
    "の": 337,
    "أ": 338,
    "ר": 339,
    "∃": 340,
    "―": 341,
    "რ": 342,
    "ע": 343,
    "θ": 344,
    "ル": 345,
    "ラ": 346,
    "ف": 347,
    "Ä": 348,
    "¯": 349,
    "⊂": 350,
    "ל": 351,
    "ъ": 352,
    "μ": 353,
    "ά": 354,
    "ß": 355,
    "ロ": 356,
    "ス": 357,
    "ვ": 358,
    "ی": 359,
    "ك": 360,
    "ή": 361,
    "Ν": 362,
    "ɪ": 363,
    "ō": 364,
    "ç": 365,
    "⁄": 366,
    "ო": 367,
    "ნ": 368,
    "א": 369,
    "ּ": 370,
    "υ": 371,
    "à": 372,
    "ه": 373,
    "ה": 374,
    "Ж": 375,
    "ú": 376,
    "ñ": 377,
    "@": 378,
    "ャ": 379,
    "マ": 380,
    "ィ": 381,
    "ん": 382,
    "გ": 383,
    "ق": 384,
    "ص": 385,
    "ת": 386,
    "ı": 387,
    "â": 388,
    "³": 389,
    "キ": 390,
    "ش": 391,
    "ز": 392,
    "έ": 393,
    "ū": 394,
    "¢": 395,
    "リ": 396,
    "ト": 397,
    "ッ": 398,
    "コ": 399,
    "ク": 400,
    "⏟": 401,
    "ש": 402,
    "ό": 403,
    "ɑ": 404,
    "ë": 405,
    "£": 406,
    "ジ": 407,
    "⇒": 408,
    "خ": 409,
    "ī": 410,
    "中": 411,
    "イ": 412,
    "≡": 413,
    "ℏ": 414,
    "„": 415,
    "დ": 416,
    "ֹ": 417,
    "ִ": 418,
    "Α": 419,
    "ğ": 420,
    "ð": 421,
    "ベ": 422,
    "フ": 423,
    "ド": 424,
    "シ": 425,
    "⨀": 426,
    "‚": 427,
    "ძ": 428,
    "შ": 429,
    "ს": 430,
    "ბ": 431,
    "َ": 432,
    "є": 433,
    "І": 434,
    "ē": 435,
    "ă": 436,
    "¿": 437,
    "©": 438,
    "国": 439,
    "ョ": 440,
    "モ": 441,
    "ミ": 442,
    "デ": 443,
    "ゴ": 444,
    "ア": 445,
    "⩾": 446,
    "⟩": 447,
    "⟨": 448,
    "∧": 449,
    "‰": 450,
    "კ": 451,
    "თ": 452,
    "ח": 453,
    "ב": 454,
    "ָ": 455,
    "ַ": 456,
    "ʊ": 457,
    "¡": 458,
    "스": 459,
    "女": 460,
    "プ": 461,
    "ニ": 462,
    "タ": 463,
    "グ": 464,
    "か": 465,
    "⏞": 466,
    "∨": 467,
    "‱": 468,
    "غ": 469,
    "ض": 470,
    "ج": 471,
    "ء": 472,
    "מ": 473,
    "ד": 474,
    "ώ": 475,
    "χ": 476,
    "ζ": 477,
    "Σ": 478,
    "Π": 479,
    "ˌ": 480,
    "ʔ": 481,
    "ɛ": 482,
    "÷": 483,
    "ì": 484,
    "ê": 485,
    "키": 486,
    "魔": 487,
    "海": 488,
    "大": 489,
    "テ": 490,
    "ダ": 491,
    "カ": 492,
    "ウ": 493,
    "ら": 494,
    "い": 495,
    "⋱": 496,
    "≥": 497,
    "∣": 498,
    "∘": 499,
    "य": 500,
    "ׁ": 501,
    "ֶ": 502,
    "ְ": 503,
    "Ә": 504,
    "Ы": 505,
    "Й": 506,
    "Ο": 507,
    "Κ": 508,
    "Ε": 509,
    "ł": 510,
    "´": 511,
    "§": 512,
    "유": 513,
    "나": 514,
    "轉": 515,
    "王": 516,
    "法": 517,
    "天": 518,
    "下": 519,
    "ュ": 520,
    "ム": 521,
    "ピ": 522,
    "ビ": 523,
    "ナ": 524,
    "オ": 525,
    "げ": 526,
    "」": 527,
    "「": 528,
    "∫": 529,
    "∖": 530,
    "↓": 531,
    "ἐ": 532,
    "ἀ": 533,
    "უ": 534,
    "ٌ": 535,
    "ط": 536,
    "ן": 537,
    "ם": 538,
    "כ": 539,
    "ύ": 540,
    "Φ": 541,
    "ʕ": 542,
    "ʃ": 543,
    "š": 544,
    "ś": 545,
    "ř": 546,
    "đ": 547,
    "č": 548,
    "Ā": 549,
    "õ": 550,
    "ò": 551,
    "î": 552,
    "Ü": 553,
    "Ö": 554,
    "하": 555,
    "이": 556,
    "만": 557,
    "다": 558,
    "香": 559,
    "少": 560,
    "地": 561,
    "台": 562,
    "動": 563,
    "人": 564,
    "五": 565,
    "ユ": 566,
    "ヤ": 567,
    "チ": 568,
    "ズ": 569,
    "サ": 570,
    "ゃ": 571,
    "ま": 572,
    "ひ": 573,
    "ち": 574,
    "た": 575,
    "し": 576,
    "さ": 577,
    "き": 578,
    "⊕": 579,
    "∏": 580,
    "∅": 581,
    "†": 582,
    "‏": 583,
    "ṭ": 584,
    "ხ": 585,
    "ტ": 586,
    "მ": 587,
    "ा": 588,
    "گ": 589,
    "پ": 590,
    "ْ": 591,
    "ِ": 592,
    "ئ": 593,
    "פ": 594,
    "ג": 595,
    "ј": 596,
    "ˋ": 597,
    "ʾ": 598,
    "ʒ": 599,
    "ʌ": 600,
    "ʁ": 601,
    "ǔ": 602,
    "Ə": 603,
    "ş": 604,
    "ã": 605,
    "Õ": 606,
    "Á": 607,
    "¬": 608,
    "퍼": 609,
    "일": 610,
    "사": 611,
    "미": 612,
    "黒": 613,
    "震": 614,
    "陛": 615,
    "道": 616,
    "賊": 617,
    "空": 618,
    "真": 619,
    "盤": 620,
    "皇": 621,
    "活": 622,
    "民": 623,
    "川": 624,
    "子": 625,
    "國": 626,
    "四": 627,
    "和": 628,
    "华": 629,
    "写": 630,
    "共": 631,
    "ブ": 632,
    "バ": 633,
    "ガ": 634,
    "ァ": 635,
    "わ": 636,
    "り": 637,
    "ば": 638,
    "は": 639,
    "く": 640,
    "え": 641,
    "あ": 642,
    "▢": 643,
    "≤": 644,
    "≃": 645,
    "∪": 646,
    "⇄": 647,
    "Ⅳ": 648,
    "€": 649,
    "ế": 650,
    "წ": 651,
    "་": 652,
    "्": 653,
    "ک": 654,
    "ى": 655,
    "ק": 656,
    "צ": 657,
    "נ": 658,
    "ז": 659,
    "ՙ": 660,
    "ұ": 661,
    "ү": 662,
    "њ": 663,
    "Щ": 664,
    "Є": 665,
    "Μ": 666,
    "ˑ": 667,
    "ʻ": 668,
    "ɹ": 669,
    "ɡ": 670,
    "ș": 671,
    "İ": 672,
    "ħ": 673,
    "ę": 674,
    "ô": 675,
    "Æ": 676,
    "Å": 677,
    "Â": 678,
    "한": 679,
    "쳐": 680,
    "은": 681,
    "월": 682,
    "우": 683,
    "시": 684,
    "브": 685,
    "범": 686,
    "반": 687,
    "문": 688,
    "랑": 689,
    "라": 690,
    "뛴": 691,
    "들": 692,
    "더": 693,
    "니": 694,
    "놈": 695,
    "김": 696,
    "기": 697,
    "국": 698,
    "게": 699,
    "가": 700,
    "麦": 701,
    "雜": 702,
    "険": 703,
    "通": 704,
    "起": 705,
    "覇": 706,
    "舞": 707,
    "肇": 708,
    "科": 709,
    "田": 710,
    "灣": 711,
    "湾": 712,
    "淛": 713,
    "浜": 714,
    "河": 715,
    "沖": 716,
    "気": 717,
    "死": 718,
    "武": 719,
    "檀": 720,
    "梅": 721,
    "松": 722,
    "杂": 723,
    "木": 724,
    "暴": 725,
    "時": 726,
    "手": 727,
    "戦": 728,
    "愛": 729,
    "常": 730,
    "帝": 731,
    "市": 732,
    "巴": 733,
    "島": 734,
    "岡": 735,
    "宙": 736,
    "宇": 737,
    "太": 738,
    "士": 739,
    "城": 740,
    "原": 741,
    "北": 742,
    "冒": 743,
    "俎": 744,
    "令": 745,
    "ワ": 746,
    "レ": 747,
    "メ": 748,
    "ペ": 749,
    "パ": 750,
    "ノ": 751,
    "ソ": 752,
    "セ": 753,
    "ゲ": 754,
    "ケ": 755,
    "エ": 756,
    "ェ": 757,
    "め": 758,
    "と": 759,
    "つ": 760,
    "っ": 761,
    "せ": 762,
    "じ": 763,
    "け": 764,
    "う": 765,
    "⌣": 766,
    "⌢": 767,
    "⋮": 768,
    "∼": 769,
    "∠": 770,
    "∙": 771,
    "←": 772,
    "⅓": 773,
    "₥": 774,
    "›": 775,
    "‹": 776,
    "Ἐ": 777,
    "ố": 778,
    "ṇ": 779,
    "ḍ": 780,
    "ყ": 781,
    "ფ": 782,
    "პ": 783,
    "ზ": 784,
    "ေ": 785,
    "ན": 786,
    "र": 787,
    "ण": 788,
    "ड": 789,
    "च": 790,
    "ख": 791,
    "٫": 792,
    "٨": 793,
    "٣": 794,
    "ّ": 795,
    "ذ": 796,
    "إ": 797,
    "ף": 798,
    "ס": 799,
    "ט": 800,
    "ґ": 801,
    "Ґ": 802,
    "ћ": 803,
    "Ї": 804,
    "ϵ": 805,
    "ϕ": 806,
    "Τ": 807,
    "Γ": 808,
    "ˤ": 809,
    "ɦ": 810,
    "ɔ": 811,
    "ɒ": 812,
    "ǰ": 813,
    "ǒ": 814,
    "Ž": 815,
    "ű": 816,
    "ő": 817,
    "ń": 818,
    "Č": 819,
    "ø": 820,
    "Ø": 821,
    "Ó": 822,
    "Ñ": 823,
    "Í": 824,
    "Ã": 825,
    "Ｚ": 826,
    "️": 827,
    "훈": 828,
    "환": 829,
    "현": 830,
    "혁": 831,
    "피": 832,
    "프": 833,
    "표": 834,
    "펙": 835,
    "틴": 836,
    "티": 837,
    "특": 838,
    "트": 839,
    "퇴": 840,
    "친": 841,
    "창": 842,
    "찬": 843,
    "짓": 844,
    "진": 845,
    "지": 846,
    "종": 847,
    "조": 848,
    "점": 849,
    "장": 850,
    "자": 851,
    "의": 852,
    "용": 853,
    "왕": 854,
    "여": 855,
    "앨": 856,
    "앤": 857,
    "아": 858,
    "싸": 859,
    "식": 860,
    "션": 861,
    "셔": 862,
    "센": 863,
    "서": 864,
    "상": 865,
    "쁜": 866,
    "뷔": 867,
    "부": 868,
    "봐": 869,
    "본": 870,
    "별": 871,
    "백": 872,
    "발": 873,
    "민": 874,
    "록": 875,
    "로": 876,
    "람": 877,
    "떴": 878,
    "드": 879,
    "데": 880,
    "눈": 881,
    "내": 882,
    "길": 883,
    "근": 884,
    "과": 885,
    "공": 886,
    "같": 887,
    "龍": 888,
    "黄": 889,
    "黃": 890,
    "鷹": 891,
    "髪": 892,
    "風": 893,
    "青": 894,
    "集": 895,
    "隊": 896,
    "阿": 897,
    "長": 898,
    "銅": 899,
    "鈴": 900,
    "野": 901,
    "里": 902,
    "部": 903,
    "進": 904,
    "进": 905,
    "軍": 906,
    "躍": 907,
    "跃": 908,
    "超": 909,
    "赤": 910,
    "貴": 911,
    "谷": 912,
    "谢": 913,
    "謝": 914,
    "要": 915,
    "行": 916,
    "蛇": 917,
    "萩": 918,
    "華": 919,
    "菜": 920,
    "芥": 921,
    "聖": 922,
    "者": 923,
    "耀": 924,
    "美": 925,
    "网": 926,
    "络": 927,
    "组": 928,
    "縄": 929,
    "組": 930,
    "米": 931,
    "神": 932,
    "矢": 933,
    "目": 934,
    "的": 935,
    "百": 936,
    "白": 937,
    "生": 938,
    "理": 939,
    "獣": 940,
    "犬": 941,
    "版": 942,
    "港": 943,
    "洋": 944,
    "汶": 945,
    "江": 946,
    "殿": 947,
    "機": 948,
    "棒": 949,
    "桜": 950,
    "栞": 951,
    "林": 952,
    "東": 953,
    "村": 954,
    "李": 955,
    "本": 956,
    "有": 957,
    "春": 958,
    "星": 959,
    "早": 960,
    "旗": 961,
    "方": 962,
    "敏": 963,
    "承": 964,
    "忍": 965,
    "年": 966,
    "平": 967,
    "師": 968,
    "寺": 969,
    "実": 970,
    "完": 971,
    "学": 972,
    "姫": 973,
    "外": 974,
    "塞": 975,
    "場": 976,
    "報": 977,
    "団": 978,
    "团": 979,
    "味": 980,
    "君": 981,
    "司": 982,
    "千": 983,
    "十": 984,
    "医": 985,
    "匠": 986,
    "勢": 987,
    "势": 988,
    "劇": 989,
    "剣": 990,
    "兵": 991,
    "公": 992,
    "八": 993,
    "全": 994,
    "光": 995,
    "先": 996,
    "候": 997,
    "侠": 998,
    "使": 999,
    "件": 1000,
    "代": 1001,
    "介": 1002,
    "井": 1003,
    "二": 1004,
    "事": 1005,
    "之": 1006,
    "世": 1007,
    "上": 1008,
    "三": 1009,
    "七": 1010,
    "一": 1011,
    "ポ": 1012,
    "ハ": 1013,
    "ゾ": 1014,
    "ゼ": 1015,
    "る": 1016,
    "や": 1017,
    "も": 1018,
    "む": 1019,
    "み": 1020,
    "へ": 1021,
    "ぱ": 1022,
    "で": 1023,
    "だ": 1024,
    "そ": 1025,
    "こ": 1026,
    "ぐ": 1027,
    "が": 1028,
    "⸘": 1029,
    "⟺": 1030,
    "❤": 1031,
    "✌": 1032,
    "☉": 1033,
    "★": 1034,
    "Ⓧ": 1035,
    "Ⓢ": 1036,
    "⋃": 1037,
    "⋂": 1038,
    "⋁": 1039,
    "√": 1040,
    "∉": 1041,
    "⇀": 1042,
    "↽": 1043,
    "⅔": 1044,
    "℗": 1045,
    "℃": 1046,
    "₉": 1047,
    "₅": 1048,
    "₄": 1049,
    "₂": 1050,
    "₁": 1051,
    "‽": 1052,
    "‒": 1053,
    "‑": 1054,
    "ῶ": 1055,
    "ῖ": 1056,
    "ὀ": 1057,
    "Ἔ": 1058,
    "ἕ": 1059,
    "ἆ": 1060,
    "ỹ": 1061,
    "ệ": 1062,
    "ẹ": 1063,
    "ḗ": 1064,
    "ታ": 1065,
    "ሪ": 1066,
    "ላ": 1067,
    "ჯ": 1068,
    "ჭ": 1069,
    "ჟ": 1070,
    "ှ": 1071,
    "ွ": 1072,
    "်": 1073,
    "ာ": 1074,
    "ရ": 1075,
    "ည": 1076,
    "င": 1077,
    "ྱ": 1078,
    "ྟ": 1079,
    "ྒ": 1080,
    "ོ": 1081,
    "ི": 1082,
    "ས": 1083,
    "ར": 1084,
    "འ": 1085,
    "ཛ": 1086,
    "ཚ": 1087,
    "མ": 1088,
    "བ": 1089,
    "ो": 1090,
    "े": 1091,
    "ू": 1092,
    "श": 1093,
    "न": 1094,
    "द": 1095,
    "झ": 1096,
    "क": 1097,
    "ऊ": 1098,
    "ं": 1099,
    "ܐ": 1100,
    "۹": 1101,
    "۷": 1102,
    "۱": 1103,
    "٦": 1104,
    "ُ": 1105,
    "ظ": 1106,
    "ث": 1107,
    "آ": 1108,
    "״": 1109,
    "ֵ": 1110,
    "ֲ": 1111,
    "ә": 1112,
    "ҙ": 1113,
    "ѣ": 1114,
    "Ѐ": 1115,
    "Ϩ": 1116,
    "ξ": 1117,
    "Χ": 1118,
    "Ρ": 1119,
    "Ι": 1120,
    "Θ": 1121,
    "Ζ": 1122,
    "Β": 1123,
    "Ή": 1124,
    "̯": 1125,
    "̦": 1126,
    "̄": 1127,
    "˙": 1128,
    "ʲ": 1129,
    "ɣ": 1130,
    "ǫ": 1131,
    "Ű": 1132,
    "ů": 1133,
    "ũ": 1134,
    "Ũ": 1135,
    "ţ": 1136,
    "Š": 1137,
    "Ş": 1138,
    "Œ": 1139,
    "Ő": 1140,
    "Ō": 1141,
    "ŋ": 1142,
    "Ē": 1143,
    "ć": 1144,
    "þ": 1145,
    "ý": 1146,
    "û": 1147,
    "ï": 1148,
    "À": 1149,
    "¼": 1150,
    "®": 1151
}