{
    "<pad>": 0,
    "<unk>": 1,
    "<s>": 2,
    "</s>": 3,
    "_": 4,
    "ա": 5,
    "e": 6,
    "ն": 7,
    "ր": 8,
    "a": 9,
    "ո": 10,
    "t": 11,
    "i": 12,
    "n": 13,
    "o": 14,
    "ի": 15,
    "ե": 16,
    "s": 17,
    "r": 18,
    "ւ": 19,
    "h": 20,
    "մ": 21,
    "l": 22,
    "d": 23,
    "կ": 24,
    "տ": 25,
    "c": 26,
    "յ": 27,
    "u": 28,
    "վ": 29,
    "m": 30,
    "ս": 31,
    ",": 32,
    "լ": 33,
    "g": 34,
    "p": 35,
    "f": 36,
    "թ": 37,
    "դ": 38,
    "հ": 39,
    "y": 40,
    "ց": 41,
    "գ": 42,
    "ը": 43,
    ".": 44,
    "w": 45,
    "b": 46,
    "1": 47,
    "ք": 48,
    "0": 49,
    "բ": 50,
    "v": 51,
    "պ": 52,
    "ղ": 53,
    "է": 54,
    "-": 55,
    "ծ": 56,
    "2": 57,
    "9": 58,
    "k": 59,
    "։": 60,
    "ռ": 61,
    "(": 62,
    "և": 63,
    ")": 64,
    "զ": 65,
    "շ": 66,
    "S": 67,
    "Ա": 68,
    "3": 69,
    "C": 70,
    "T": 71,
    "A": 72,
    "ջ": 73,
    "խ": 74,
    "8": 75,
    "\"": 76,
    "5": 77,
    "4": 78,
    "B": 79,
    "7": 80,
    "չ": 81,
    "I": 82,
    "M": 83,
    "6": 84,
    ":": 85,
    "P": 86,
    "D": 87,
    "x": 88,
    "H": 89,
    "օ": 90,
    "ժ": 91,
    "R": 92,
    "փ": 93,
    "Հ": 94,
    "՝": 95,
    "L": 96,
    "W": 97,
    "N": 98,
    "Մ": 99,
    "Ս": 100,
    "E": 101,
    "F": 102,
    "'": 103,
    "ձ": 104,
    "O": 105,
    "G": 106,
    "ֆ": 107,
    "J": 108,
    "ճ": 109,
    "z": 110,
    "K": 111,
    "Գ": 112,
    "»": 113,
    "«": 114,
    "V": 115,
    "Ն": 116,
    "Կ": 117,
    "Բ": 118,
    "q": 119,
    "Լ": 120,
    "}": 121,
    "Դ": 122,
    "U": 123,
    "j": 124,
    "Տ": 125,
    "/": 126,
    "{": 127,
    "а": 128,
    "и": 129,
    "–": 130,
    "Ե": 131,
    "Պ": 132,
    "Վ": 133,
    "!": 134,
    "о": 135,
    "Փ": 136,
    "X": 137,
    "Ծ": 138,
    "\\": 139,
    "Ֆ": 140,
    "Ռ": 141,
    "е": 142,
    ";": 143,
    "Y": 144,
    "Շ": 145,
    "—": 146,
    "Ի": 147,
    "н": 148,
    "р": 149,
    "Օ": 150,
    "с": 151,
    "Թ": 152,
    "т": 153,
    "Ք": 154,
    "Է": 155,
    "Ջ": 156,
    "Ո": 157,
    "ǃ": 158,
    "л": 159,
    "к": 160,
    "Չ": 161,
    "в": 162,
    "=": 163,
    "+": 164,
    "°": 165,
    "[": 166,
    "]": 167,
    "Յ": 168,
    "ʼ": 169,
    "Խ": 170,
    "Ը": 171,
    "`": 172,
    "Z": 173,
    "м": 174,
    "&": 175,
    "Q": 176,
    "á": 177,
    "․": 178,
    "д": 179,
    "я": 180,
    "%": 181,
    "й": 182,
    "ǀ": 183,
    "у": 184,
    "é": 185,
    "п": 186,
    "Զ": 187,
    "ó": 188,
    "г": 189,
    "ā": 190,
    "Ʞ": 191,
    "Ժ": 192,
    "?": 193,
    "$": 194,
    "ы": 195,
    "ǂ": 196,
    "М": 197,
    "ь": 198,
    "í": 199,
    "ч": 200,
    "’": 201,
    "Ց": 202,
    "б": 203,
    "з": 204,
    "^": 205,
    "à": 206,
    "”": 207,
    "С": 208,
    "ō": 209,
    "“": 210,
    "*": 211,
    "֊": 212,
    "х": 213,
    "ц": 214,
    "А": 215,
    "¡": 216,
    "ì": 217,
    "ú": 218,
    "К": 219,
    "õ": 220,
    "⟩": 221,
    "ū": 222,
    "ǎ": 223,
    "錢": 224,
    "Ճ": 225,
    "<": 226,
    "⟨": 227,
    "ф": 228,
    "ǁ": 229,
    "В": 230,
    "П": 231,
    "钱": 232,
    ">": 233,
    "ü": 234,
    "И": 235,
    "ö": 236,
    "՛": 237,
    "Ղ": 238,
    "О": 239,
    "#": 240,
    "ò": 241,
    "Н": 242,
    "ш": 243,
    "Ձ": 244,
    "Б": 245,
    "寶": 246,
    "−": 247,
    "ù": 248,
    "|": 249,
    "α": 250,
    "Д": 251,
    "Г": 252,
    "ж": 253,
    "ŋ": 254,
    "è": 255,
    "э": 256,
    "ʰ": 257,
    "Р": 258,
    "ː": 259,
    "通": 260,
    "â": 261,
    "ũ": 262,
    "ǐ": 263,
    "Л": 264,
    "ī": 265,
    "ー": 266,
    "Т": 267,
    "ا": 268,
    "…": 269,
    "ǔ": 270,
    "͡": 271,
    "ю": 272,
    "Ф": 273,
    "ン": 274,
    "Х": 275,
    "Э": 276,
    "ɲ": 277,
    "子": 278,
    "ã": 279,
    "†": 280,
    "平": 281,
    "‎": 282,
    "ệ": 283,
    "ل": 284,
    "~": 285,
    "У": 286,
    "Е": 287,
    "β": 288,
    "品": 289,
    "ă": 290,
    "文": 291,
    "ο": 292,
    "ε": 293,
    "×": 294,
    "ʘ": 295,
    "‘": 296,
    "χ": 297,
    "і": 298,
    "ʔ": 299,
    "・": 300,
    "→": 301,
    "ˀ": 302,
    "Ր": 303,
    "щ": 304,
    "ē": 305,
    "№": 306,
    "花": 307,
    "​": 308,
    "π": 309,
    "ι": 310,
    "壽": 311,
    "ク": 312,
    "太": 313,
    "τ": 314,
    "½": 315,
    "明": 316,
    "福": 317,
    "ب": 318,
    "ñ": 319,
    "م": 320,
    "天": 321,
    "Я": 322,
    "ρ": 323,
    "五": 324,
    "中": 325,
    "牌": 326,
    "ن": 327,
    "З": 328,
    "ν": 329,
    "大": 330,
    "四": 331,
    "ი": 332,
    "ر": 333,
    "՞": 334,
    "ع": 335,
    "σ": 336,
    "κ": 337,
    "ί": 338,
    "ɔ": 339,
    "ô": 340,
    "ა": 341,
    "ˈ": 342,
    "形": 343,
    "ッ": 344,
    "ス": 345,
    "و": 346,
    "ς": 347,
    "光": 348,
    "人": 349,
    "二": 350,
    "Ш": 351,
    "貴": 352,
    "下": 353,
    "±": 354,
    "λ": 355,
    "ə": 356,
    "ä": 357,
    "§": 358,
    "金": 359,
    "祥": 360,
    "十": 361,
    "ᵑ": 362,
    "د": 363,
    "̰": 364,
    "²": 365,
    "童": 366,
    "ე": 367,
    "˦": 368,
    "蘭": 369,
    "空": 370,
    "ト": 371,
    "イ": 372,
    "˧": 373,
    "ʾ": 374,
    "ș": 375,
    "ê": 376,
    "長": 377,
    "當": 378,
    "吉": 379,
    "佛": 380,
    "̃": 381,
    "ł": 382,
    "Á": 383,
    "@": 384,
    "雷": 385,
    "挂": 386,
    "幣": 387,
    "ي": 388,
    "Ч": 389,
    "γ": 390,
    "ë": 391,
    "萬": 392,
    "胜": 393,
    "ラ": 394,
    "η": 395,
    "ś": 396,
    "重": 397,
    "百": 398,
    "康": 399,
    "女": 400,
    "ル": 401,
    "ア": 402,
    "の": 403,
    "Ւ": 404,
    "δ": 405,
    "̊": 406,
    "符": 407,
    "神": 408,
    "熙": 409,
    "意": 410,
    "安": 411,
    "千": 412,
    "シ": 413,
    "↑": 414,
    "•": 415,
    "―": 416,
    "̦": 417,
    "ơ": 418,
    "¿": 419,
    "道": 420,
    "布": 421,
    "字": 422,
    "压": 423,
    "冥": 424,
    "リ": 425,
    "ё": 426,
    "Ю": 427,
    "υ": 428,
    "ʃ": 429,
    "ş": 430,
    "豐": 431,
    "緒": 432,
    "泰": 433,
    "八": 434,
    "ロ": 435,
    "ї": 436,
    "ɡ": 437,
    "連": 438,
    "我": 439,
    "富": 440,
    "代": 441,
    "ド": 442,
    "μ": 443,
    "·": 444,
    "­": 445,
    "生": 446,
    "フ": 447,
    "⁄": 448,
    "س": 449,
    "Ц": 450,
    "Δ": 451,
    "ɪ": 452,
    "Đ": 453,
    "æ": 454,
    "打": 455,
    "他": 456,
    "≈": 457,
    "„": 458,
    "ح": 459,
    "ɢ": 460,
    "Ā": 461,
    "ý": 462,
    "£": 463,
    "阿": 464,
    "避": 465,
    "織": 466,
    "火": 467,
    "桂": 468,
    "教": 469,
    "掛": 470,
    "國": 471,
    "和": 472,
    "命": 473,
    "九": 474,
    "マ": 475,
    "チ": 476,
    "タ": 477,
    "キ": 478,
    "↓": 479,
    "ლ": 480,
    "ی": 481,
    "ت": 482,
    "û": 483,
    "華": 484,
    "秘": 485,
    "孝": 486,
    "ィ": 487,
    "ễ": 488,
    "ע": 489,
    "ό": 490,
    "ά": 491,
    "ɾ": 492,
    "ç": 493,
    "魚": 494,
    "音": 495,
    "陀": 496,
    "貨": 497,
    "胡": 498,
    "耕": 499,
    "歲": 500,
    "樹": 501,
    "書": 502,
    "彌": 503,
    "寓": 504,
    "仵": 505,
    "プ": 506,
    "ダ": 507,
    "‼": 508,
    "ו": 509,
    "ʒ": 510,
    "象": 511,
    "石": 512,
    "敢": 513,
    "家": 514,
    "壓": 515,
    "厌": 516,
    "仙": 517,
    "ẽ": 518,
    "რ": 519,
    "ო": 520,
    "أ": 521,
    "ל": 522,
    "ʗ": 523,
    "č": 524,
    "马": 525,
    "镂": 526,
    "芝": 527,
    "年": 528,
    "デ": 529,
    "ジ": 530,
    "サ": 531,
    "€": 532,
    "ნ": 533,
    "გ": 534,
    "ة": 535,
    "ר": 536,
    "θ": 537,
    "έ": 538,
    "ț": 539,
    "š": 540,
    "邪": 541,
    "葫": 542,
    "舞": 543,
    "無": 544,
    "武": 545,
    "景": 546,
    "土": 547,
    "国": 548,
    "周": 549,
    "南": 550,
    "元": 551,
    "レ": 552,
    "ュ": 553,
    "᥄": 554,
    "ᠣ": 555,
    "ვ": 556,
    "˥": 557,
    "꞉": 558,
    "馗": 559,
    "飾": 560,
    "鍾": 561,
    "行": 562,
    "皇": 563,
    "玉": 564,
    "桃": 565,
    "格": 566,
    "孫": 567,
    "季": 568,
    "夫": 569,
    "合": 570,
    "古": 571,
    "令": 572,
    "为": 573,
    "上": 574,
    "ョ": 575,
    "ウ": 576,
    "ん": 577,
    "≠": 578,
    "‽": 579,
    "ه": 580,
    "ق": 581,
    "ف": 582,
    "א": 583,
    "Ж": 584,
    "Ν": 585,
    "ǒ": 586,
    "ě": 587,
    "ð": 588,
    "Ä": 589,
    "黃": 590,
    "鳳": 591,
    "驅": 592,
    "霆": 593,
    "降": 594,
    "谐": 595,
    "藏": 596,
    "的": 597,
    "瘦": 598,
    "男": 599,
    "民": 600,
    "毒": 601,
    "正": 602,
    "棄": 603,
    "春": 604,
    "戏": 605,
    "德": 606,
    "回": 607,
    "咸": 608,
    "入": 609,
    "余": 610,
    "且": 611,
    "ム": 612,
    "コ": 613,
    "∞": 614,
    "′": 615,
    "՜": 616,
    "˩": 617,
    "ʲ": 618,
    "ɟ": 619,
    "鯉": 620,
    "風": 621,
    "陶": 622,
    "鎖": 623,
    "銖": 624,
    "辟": 625,
    "莫": 626,
    "與": 627,
    "秋": 628,
    "禦": 629,
    "田": 630,
    "海": 631,
    "楚": 632,
    "朝": 633,
    "日": 634,
    "押": 635,
    "影": 636,
    "圖": 637,
    "兵": 638,
    "伎": 639,
    "ワ": 640,
    "ビ": 641,
    "エ": 642,
    "ァ": 643,
    "∈": 644,
    "ṡ": 645,
    "َ": 646,
    "ك": 647,
    "ص": 648,
    "ش": 649,
    "خ": 650,
    "ת": 651,
    "ש": 652,
    "י": 653,
    "Γ": 654,
    "̞": 655,
    "ư": 656,
    "Ř": 657,
    "ı": 658,
    "ğ": 659,
    "ę": 660,
    "¼": 661,
    "³": 662,
    "，": 663,
    "馬": 664,
    "詩": 665,
    "稱": 666,
    "物": 667,
    "洪": 668,
    "松": 669,
    "時": 670,
    "山": 671,
    "如": 672,
    "城": 673,
    "博": 674,
    "勝": 675,
    "ャ": 676,
    "グ": 677,
    "っ": 678,
    "ả": 679,
    "ᤚ": 680,
    "ძ": 681,
    "̂": 682,
    "ɛ": 683,
    "ɑ": 684,
    "ß": 685,
    "龍": 686,
    "鎮": 687,
    "親": 688,
    "虫": 689,
    "藍": 690,
    "絲": 691,
    "津": 692,
    "洞": 693,
    "河": 694,
    "庫": 695,
    "宮": 696,
    "官": 697,
    "君": 698,
    "做": 699,
    "俗": 700,
    "事": 701,
    "モ": 702,
    "ベ": 703,
    "パ": 704,
    "ゾ": 705,
    "ズ": 706,
    "オ": 707,
    "∓": 708,
    "›": 709,
    "‹": 710,
    "‡": 711,
    "ầ": 712,
    "ს": 713,
    "დ": 714,
    "ز": 715,
    "ה": 716,
    "Ә": 717,
    "ъ": 718,
    "І": 719,
    "ω": 720,
    "φ": 721,
    "́": 722,
    "ʻ": 723,
    "ʌ": 724,
    "ʊ": 725,
    "ő": 726,
    "ĩ": 727,
    "©": 728,
    "¢": 729,
    "陽": 730,
    "阴": 731,
    "闇": 732,
    "镇": 733,
    "起": 734,
    "財": 735,
    "语": 736,
    "說": 737,
    "蓝": 738,
    "节": 739,
    "罵": 740,
    "篆": 741,
    "笑": 742,
    "祺": 743,
    "看": 744,
    "瘞": 745,
    "瘗": 746,
    "疊": 747,
    "玲": 748,
    "玩": 749,
    "王": 750,
    "父": 751,
    "煥": 752,
    "為": 753,
    "水": 754,
    "歷": 755,
    "月": 756,
    "星": 757,
    "散": 758,
    "敕": 759,
    "捧": 760,
    "戲": 761,
    "慶": 762,
    "愛": 763,
    "忠": 764,
    "延": 765,
    "库": 766,
    "寿": 767,
    "寅": 768,
    "容": 769,
    "婦": 770,
    "套": 771,
    "器": 772,
    "叠": 773,
    "厭": 774,
    "原": 775,
    "卦": 776,
    "制": 777,
    "之": 778,
    "七": 779,
    "ミ": 780,
    "ニ": 781,
    "テ": 782,
    "ゲ": 783,
    "カ": 784,
    "あ": 785,
    "」": 786,
    "「": 787,
    "ᤐ": 788,
    "ᠪ": 789,
    "შ": 790,
    "კ": 791,
    "თ": 792,
    "ბ": 793,
    "ک": 794,
    "є": 795,
    "ξ": 796,
    "ζ": 797,
    "ή": 798,
    "Σ": 799,
    "Μ": 800,
    "̩": 801,
    "ů": 802,
    "ř": 803,
    "Ō": 804,
    "ą": 805,
    "´": 806,
    "｣": 807,
    "｢": 808,
    "이": 809,
    "다": 810,
    "나": 811,
    "鸟": 812,
    "鱼": 813,
    "魔": 814,
    "騰": 815,
    "馆": 816,
    "饰": 817,
    "雪": 818,
    "雜": 819,
    "雙": 820,
    "雍": 821,
    "隆": 822,
    "陳": 823,
    "陰": 824,
    "锁": 825,
    "鏤": 826,
    "野": 827,
    "郢": 828,
    "遣": 829,
    "连": 830,
    "輪": 831,
    "輝": 832,
    "護": 833,
    "諧": 834,
    "言": 835,
    "觀": 836,
    "蠶": 837,
    "蟲": 838,
    "蛟": 839,
    "萼": 840,
    "芦": 841,
    "臣": 842,
    "腑": 843,
    "肺": 844,
    "聚": 845,
    "義": 846,
    "罗": 847,
    "织": 848,
    "科": 849,
    "祜": 850,
    "眼": 851,
    "盘": 852,
    "盆": 853,
    "異": 854,
    "界": 855,
    "煞": 856,
    "泥": 857,
    "泉": 858,
    "死": 859,
    "樣": 860,
    "樂": 861,
    "树": 862,
    "时": 863,
    "摇": 864,
    "搖": 865,
    "慈": 866,
    "帝": 867,
    "币": 868,
    "州": 869,
    "寧": 870,
    "宫": 871,
    "宝": 872,
    "妇": 873,
    "好": 874,
    "夀": 875,
    "呈": 876,
    "午": 877,
    "前": 878,
    "利": 879,
    "出": 880,
    "兩": 881,
    "倫": 882,
    "倍": 883,
    "乾": 884,
    "也": 885,
    "世": 886,
    "ブ": 887,
    "バ": 888,
    "ソ": 889,
    "ゴ": 890,
    "た": 891,
    "か": 892,
    "。": 893,
    "≥": 894,
    "≤": 895,
    "ἀ": 896,
    "ụ": 897,
    "უ": 898,
    "य": 899,
    "ٌ": 900,
    "ض": 901,
    "ώ": 902,
    "Α": 903,
    "ʁ": 904,
    "É": 905,
    "！": 906,
    "﹗": 907,
    "鳥": 908,
    "香": 909,
    "靈": 910,
    "除": 911,
    "阳": 912,
    "邴": 913,
    "蚩": 914,
    "蘆": 915,
    "統": 916,
    "笮": 917,
    "相": 918,
    "琮": 919,
    "珑": 920,
    "玄": 921,
    "爰": 922,
    "毋": 923,
    "榮": 924,
    "案": 925,
    "杂": 926,
    "方": 927,
    "拜": 928,
    "忘": 929,
    "异": 930,
    "尤": 931,
    "宜": 932,
    "學": 933,
    "孚": 934,
    "央": 935,
    "地": 936,
    "囯": 937,
    "名": 938,
    "同": 939,
    "去": 940,
    "华": 941,
    "卍": 942,
    "化": 943,
    "凹": 944,
    "凶": 945,
    "兄": 946,
    "儀": 947,
    "傳": 948,
    "作": 949,
    "佑": 950,
    "今": 951,
    "书": 952,
    "乐": 953,
    "三": 954,
    "ハ": 955,
    "ナ": 956,
    "セ": 957,
    "ケ": 958,
    "ひ": 959,
    "じ": 960,
    "げ": 961,
    "い": 962,
    "〜": 963,
    "《": 964,
    "⩲": 965,
    "⩱": 966,
    "○": 967,
    "□": 968,
    "⊕": 969,
    "‱": 970,
    "‚": 971,
    "ữ": 972,
    "Ḷ": 973,
    "ᶢ": 974,
    "ᤦ": 975,
    "ᤥ": 976,
    "ᤌ": 977,
    "ᤄ": 978,
    "ᤂ": 979,
    "ფ": 980,
    "მ": 981,
    "پ": 982,
    "ْ": 983,
    "ى": 984,
    "כ": 985,
    "ד": 986,
    "ּ": 987,
    "ָ": 988,
    "ַ": 989,
    "ְ": 990,
    "ұ": 991,
    "Й": 992,
    "ύ": 993,
    "ˌ": 994,
    "ʕ": 995,
    "ǚ": 996,
    "ń": 997,
    "ć": 998,
    "Ü": 999,
    "Õ": 1000,
    "Ç": 1001,
    "Æ": 1002,
    "Ｚ": 1003,
    "Ｖ": 1004,
    "Ｔ": 1005,
    "７": 1006,
    "）": 1007,
    "（": 1008,
    "＆": 1009,
    "사": 1010,
    "뛴": 1011,
    "黒": 1012,
    "鬥": 1013,
    "餅": 1014,
    "震": 1015,
    "陛": 1016,
    "郎": 1017,
    "進": 1018,
    "轉": 1019,
    "質": 1020,
    "诗": 1021,
    "紀": 1022,
    "第": 1023,
    "禎": 1024,
    "社": 1025,
    "版": 1026,
    "潮": 1027,
    "桐": 1028,
    "株": 1029,
    "木": 1030,
    "敬": 1031,
    "招": 1032,
    "才": 1033,
    "手": 1034,
    "式": 1035,
    "師": 1036,
    "川": 1037,
    "崇": 1038,
    "局": 1039,
    "宇": 1040,
    "士": 1041,
    "場": 1042,
    "口": 1043,
    "北": 1044,
    "劇": 1045,
    "内": 1046,
    "共": 1047,
    "先": 1048,
    "会": 1049,
    "丁": 1050,
    "ホ": 1051,
    "ツ": 1052,
    "ォ": 1053,
    "ゃ": 1054,
    "ま": 1055,
    "し": 1056,
    "さ": 1057,
    "け": 1058,
    "》": 1059,
    "⸘": 1060,
    "⌓": 1061,
    "∇": 1062,
    "↻": 1063,
    "⁉": 1064,
    "⁈": 1065,
    "‰": 1066,
    "ử": 1067,
    "ợ": 1068,
    "ọ": 1069,
    "ế": 1070,
    "ṅ": 1071,
    "ყ": 1072,
    "ტ": 1073,
    "ِ": 1074,
    "غ": 1075,
    "ط": 1076,
    "ئ": 1077,
    "إ": 1078,
    "ء": 1079,
    "צ": 1080,
    "מ": 1081,
    "ב": 1082,
    "ׁ": 1083,
    "ֹ": 1084,
    "ү": 1085,
    "ј": 1086,
    "Ы": 1087,
    "Є": 1088,
    "Ω": 1089,
    "̝": 1090,
    "ˤ": 1091,
    "ˋ": 1092,
    "ʟ": 1093,
    "ɹ": 1094,
    "Š": 1095,
    "đ": 1096,
    "î": 1097,
    "Ó": 1098,
    "µ": 1099,
    "～": 1100,
    "：": 1101,
    "０": 1102,
    "하": 1103,
    "의": 1104,
    "은": 1105,
    "시": 1106,
    "스": 1107,
    "브": 1108,
    "랑": 1109,
    "라": 1110,
    "들": 1111,
    "더": 1112,
    "놈": 1113,
    "김": 1114,
    "게": 1115,
    "가": 1116,
    "ꜞ": 1117,
    "館": 1118,
    "面": 1119,
    "静": 1120,
    "銅": 1121,
    "邸": 1122,
    "遊": 1123,
    "迷": 1124,
    "辛": 1125,
    "車": 1126,
    "賊": 1127,
    "谷": 1128,
    "谢": 1129,
    "謝": 1130,
    "術": 1131,
    "蜘": 1132,
    "蛛": 1133,
    "藤": 1134,
    "英": 1135,
    "良": 1136,
    "者": 1137,
    "瓏": 1138,
    "理": 1139,
    "獏": 1140,
    "爆": 1141,
    "炮": 1142,
    "浜": 1143,
    "此": 1144,
    "本": 1145,
    "戯": 1146,
    "您": 1147,
    "御": 1148,
    "弾": 1149,
    "市": 1150,
    "巴": 1151,
    "島": 1152,
    "岡": 1153,
    "報": 1154,
    "執": 1155,
    "在": 1156,
    "吾": 1157,
    "台": 1158,
    "卒": 1159,
    "勢": 1160,
    "們": 1161,
    "伽": 1162,
    "仮": 1163,
    "井": 1164,
    "一": 1165,
    "ヤ": 1166,
    "メ": 1167,
    "ポ": 1168,
    "ボ": 1169,
    "ピ": 1170,
    "ガ": 1171,
    "ェ": 1172,
    "り": 1173,
    "く": 1174,
    "❣": 1175,
    "❗": 1176,
    "⚠": 1177,
    "▢": 1178,
    "⋅": 1179,
    "≡": 1180,
    "⇧": 1181,
    "Ⅳ": 1182,
    "₂": 1183,
    "″": 1184,
    "ῶ": 1185,
    "ὴ": 1186,
    "ἐ": 1187,
    "ỹ": 1188,
    "ạ": 1189,
    "ṭ": 1190,
    "ḕ": 1191,
    "ᵡ": 1192,
    "ᤨ": 1193,
    "ᤤ": 1194,
    "ᤢ": 1195,
    "ᤛ": 1196,
    "ᤙ": 1197,
    "ᤘ": 1198,
    "ᤗ": 1199,
    "ᤖ": 1200,
    "ᤔ": 1201,
    "ᤑ": 1202,
    "ᤊ": 1203,
    "ᤇ": 1204,
    "ᤆ": 1205,
    "ᤅ": 1206,
    "ᤃ": 1207,
    "ჯ": 1208,
    "წ": 1209,
    "ზ": 1210,
    "ा": 1211,
    "च": 1212,
    "ّ": 1213,
    "פ": 1214,
    "נ": 1215,
    "ט": 1216,
    "ג": 1217,
    "ֶ": 1218,
    "ִ": 1219,
    "ѣ": 1220,
    "њ": 1221,
    "Ї": 1222,
    "Χ": 1223,
    "Τ": 1224,
    "Π": 1225,
    "Ο": 1226,
    "Β": 1227,
    "̀": 1228,
    "˙": 1229,
    "ɒ": 1230,
    "Ə": 1231,
    "ż": 1232,
    "Ł": 1233,
    "ħ": 1234,
    "þ": 1235,
    "÷": 1236,
    "Ø": 1237,
    "Ñ": 1238,
    "Å": 1239,
    "¥": 1240,
    "🕴": 1241,
    "💎": 1242,
    "👑": 1243,
    "Ｗ": 1244,
    "Ｒ": 1245,
    "Ｐ": 1246,
    "Ｍ": 1247,
    "Ｊ": 1248,
    "Ｇ": 1249,
    "Ｅ": 1250,
    "Ｄ": 1251,
    "１": 1252,
    "．": 1253,
    "훈": 1254,
    "환": 1255,
    "현": 1256,
    "한": 1257,
    "피": 1258,
    "프": 1259,
    "퍼": 1260,
    "틴": 1261,
    "티": 1262,
    "특": 1263,
    "퇴": 1264,
    "키": 1265,
    "친": 1266,
    "창": 1267,
    "찬": 1268,
    "짓": 1269,
    "지": 1270,
    "종": 1271,
    "조": 1272,
    "점": 1273,
    "자": 1274,
    "우": 1275,
    "용": 1276,
    "왕": 1277,
    "여": 1278,
    "앤": 1279,
    "아": 1280,
    "싸": 1281,
    "셔": 1282,
    "상": 1283,
    "쁜": 1284,
    "부": 1285,
    "봐": 1286,
    "별": 1287,
    "범": 1288,
    "반": 1289,
    "미": 1290,
    "문": 1291,
    "록": 1292,
    "로": 1293,
    "람": 1294,
    "떴": 1295,
    "드": 1296,
    "눈": 1297,
    "내": 1298,
    "길": 1299,
    "기": 1300,
    "근": 1301,
    "국": 1302,
    "과": 1303,
    "같": 1304,
    "ꜟ": 1305,
    "ꜝ": 1306,
    "黄": 1307,
    "鷹": 1308,
    "鶴": 1309,
    "鴻": 1310,
    "鯨": 1311,
    "髪": 1312,
    "騒": 1313,
    "首": 1314,
    "頭": 1315,
    "青": 1316,
    "集": 1317,
    "雀": 1318,
    "闘": 1319,
    "閆": 1320,
    "門": 1321,
    "钧": 1322,
    "錠": 1323,
    "鉴": 1324,
    "鈴": 1325,
    "鈞": 1326,
    "里": 1327,
    "配": 1328,
    "部": 1329,
    "遠": 1330,
    "退": 1331,
    "軍": 1332,
    "路": 1333,
    "足": 1334,
    "赤": 1335,
    "謎": 1336,
    "諮": 1337,
    "詢": 1338,
    "計": 1339,
    "見": 1340,
    "覇": 1341,
    "西": 1342,
    "裸": 1343,
    "蝶": 1344,
    "蛾": 1345,
    "蛭": 1346,
    "蛇": 1347,
    "蔵": 1348,
    "萩": 1349,
    "菜": 1350,
    "菁": 1351,
    "自": 1352,
    "耀": 1353,
    "翔": 1354,
    "羽": 1355,
    "美": 1356,
    "続": 1357,
    "竜": 1358,
    "秦": 1359,
    "秤": 1360,
    "矢": 1361,
    "真": 1362,
    "目": 1363,
    "盤": 1364,
    "白": 1365,
    "畢": 1366,
    "甫": 1367,
    "產": 1368,
    "猿": 1369,
    "猪": 1370,
    "烈": 1371,
    "点": 1372,
    "炳": 1373,
    "灰": 1374,
    "灣": 1375,
    "瀬": 1376,
    "漁": 1377,
    "湾": 1378,
    "港": 1379,
    "渡": 1380,
    "洋": 1381,
    "沖": 1382,
    "決": 1383,
    "汶": 1384,
    "江": 1385,
    "永": 1386,
    "気": 1387,
    "殿": 1388,
    "業": 1389,
    "森": 1390,
    "棒": 1391,
    "梶": 1392,
    "梅": 1393,
    "梁": 1394,
    "桜": 1395,
    "根": 1396,
    "栞": 1397,
    "東": 1398,
    "村": 1399,
    "李": 1400,
    "札": 1401,
    "有": 1402,
    "會": 1403,
    "暴": 1404,
    "映": 1405,
    "早": 1406,
    "料": 1407,
    "敏": 1408,
    "支": 1409,
    "振": 1410,
    "承": 1411,
    "戴": 1412,
    "懷": 1413,
    "想": 1414,
    "情": 1415,
    "念": 1416,
    "志": 1417,
    "徐": 1418,
    "彦": 1419,
    "彥": 1420,
    "弟": 1421,
    "度": 1422,
    "幻": 1423,
    "己": 1424,
    "崎": 1425,
    "寺": 1426,
    "完": 1427,
    "守": 1428,
    "学": 1429,
    "孤": 1430,
    "孔": 1431,
    "姫": 1432,
    "姆": 1433,
    "外": 1434,
    "声": 1435,
    "坂": 1436,
    "团": 1437,
    "囚": 1438,
    "哥": 1439,
    "司": 1440,
    "号": 1441,
    "句": 1442,
    "双": 1443,
    "医": 1444,
    "匠": 1445,
    "势": 1446,
    "剛": 1447,
    "刈": 1448,
    "切": 1449,
    "冉": 1450,
    "円": 1451,
    "六": 1452,
    "公": 1453,
    "全": 1454,
    "児": 1455,
    "克": 1456,
    "優": 1457,
    "候": 1458,
    "侠": 1459,
    "体": 1460,
    "似": 1461,
    "了": 1462,
    "万": 1463,
    "ヴ": 1464,
    "ペ": 1465,
    "ヒ": 1466,
    "ノ": 1467,
    "ネ": 1468,
    "ヌ": 1469,
    "ゼ": 1470,
    "ザ": 1471,
    "も": 1472,
    "め": 1473,
    "ぱ": 1474,
    "は": 1475,
    "ね": 1476,
    "で": 1477,
    "せ": 1478,
    "が": 1479,
    "え": 1480,
    "う": 1481,
    "⸼": 1482,
    "⸮": 1483,
    "⨎": 1484,
    "❢": 1485,
    "❕": 1486,
    "✌": 1487,
    "♯": 1488,
    "⌘": 1489,
    "⊚": 1490,
    "∙": 1491,
    "∗": 1492,
    "∅": 1493,
    "⇄": 1494,
    "↵": 1495,
    "℗": 1496,
    "℃": 1497,
    "₥": 1498,
    "₉": 1499,
    "₅": 1500,
    "₄": 1501,
    "₁": 1502,
    "⁡": 1503,
    "‛": 1504,
    "‑": 1505,
    "ὸ": 1506,
    "ὁ": 1507,
    "ἕ": 1508,
    "ỳ": 1509,
    "ứ": 1510,
    "ớ": 1511,
    "ỗ": 1512,
    "ố": 1513,
    "ị": 1514,
    "ắ": 1515,
    "ậ": 1516,
    "ṹ": 1517,
    "ṇ": 1518,
    "ḿ": 1519,
    "ḥ": 1520,
    "ḍ": 1521,
    "።": 1522,
    "ხ": 1523,
    "ჭ": 1524,
    "ჟ": 1525,
    "႟": 1526,
    "෴": 1527,
    "।": 1528,
    "्": 1529,
    "ो": 1530,
    "े": 1531,
    "ू": 1532,
    "न": 1533,
    "द": 1534,
    "ण": 1535,
    "ड": 1536,
    "झ": 1537,
    "ख": 1538,
    "ऊ": 1539,
    "ं": 1540,
    "߹": 1541,
    "۔": 1542,
    "گ": 1543,
    "٫": 1544,
    "ٔ": 1545,
    "ُ": 1546,
    "ظ": 1547,
    "ذ": 1548,
    "ج": 1549,
    "ث": 1550,
    "ף": 1551,
    "ס": 1552,
    "ם": 1553,
    "ח": 1554,
    "ז": 1555,
    "ֵ": 1556,
    "ә": 1557,
    "ґ": 1558,
    "Ґ": 1559,
    "ћ": 1560,
    "Щ": 1561,
    "Ѐ": 1562,
    "Ϩ": 1563,
    "ϕ": 1564,
    "Λ": 1565,
    "Κ": 1566,
    "Θ": 1567,
    "Η": 1568,
    "Ζ": 1569,
    "Ή": 1570,
    "̬": 1571,
    "ˑ": 1572,
    "ʷ": 1573,
    "ɦ": 1574,
    "ɣ": 1575,
    "ɐ": 1576,
    "Ȝ": 1577,
    "ǫ": 1578,
    "ź": 1579,
    "ű": 1580,
    "Ű": 1581,
    "Ũ": 1582,
    "Œ": 1583,
    "Ő": 1584,
    "İ": 1585,
    "ÿ": 1586,
    "ø": 1587,
    "ï": 1588,
    "å": 1589,
    "Ö": 1590,
    "Í": 1591,
    "Ã": 1592,
    "Â": 1593,
    "¾": 1594,
    "®": 1595
}