{
    "<pad>": 0,
    "<unk>": 1,
    "<s>": 2,
    "</s>": 3,
    "_": 4,
    "a": 5,
    "n": 6,
    "e": 7,
    "r": 8,
    "i": 9,
    "t": 10,
    "o": 11,
    "s": 12,
    "m": 13,
    "l": 14,
    "h": 15,
    "k": 16,
    "d": 17,
    "w": 18,
    "v": 19,
    "c": 20,
    "vo": 21,
    "y": 22,
    "ye": 23,
    "p": 24,
    "g": 25,
    "u": 26,
    "b": 27,
    ",": 28,
    "f": 29,
    "j": 30,
    ".": 31,
    "1": 32,
    "A": 33,
    "ts": 34,
    "0": 35,
    "x": 36,
    "-": 37,
    "th": 38,
    "2": 39,
    "z": 40,
    "S": 41,
    "9": 42,
    "(": 43,
    "gh": 44,
    "q": 45,
    ")": 46,
    "T": 47,
    "M": 48,
    "C": 49,
    ":": 50,
    "3": 51,
    "4": 52,
    "@": 53,
    "H": 54,
    "8": 55,
    "P": 56,
    "B": 57,
    "\"": 58,
    "I": 59,
    "5": 60,
    "7": 61,
    "D": 62,
    "N": 63,
    "6": 64,
    "G": 65,
    "L": 66,
    "&": 67,
    "R": 68,
    "K": 69,
    "E": 70,
    "sh": 71,
    "W": 72,
    "F": 73,
    "O": 74,
    "J": 75,
    "'": 76,
    "dj": 77,
    "kh": 78,
    "ch": 79,
    "yew": 80,
    "ev": 81,
    "V": 82,
    "ew": 83,
    "yev": 84,
    "`": 85,
    "»": 86,
    "«": 87,
    "}": 88,
    "U": 89,
    "/": 90,
    "{": 91,
    "zh": 92,
    "Y": 93,
    "а": 94,
    "и": 95,
    "–": 96,
    "!": 97,
    "X": 98,
    "о": 99,
    "\\": 100,
    "dz": 101,
    "е": 102,
    ";": 103,
    "—": 104,
    "н": 105,
    "р": 106,
    "с": 107,
    "т": 108,
    "Q": 109,
    "tch": 110,
    "Z": 111,
    "YE": 112,
    "ǃ": 113,
    "л": 114,
    "к": 115,
    "в": 116,
    "=": 117,
    "+": 118,
    "°": 119,
    "[": 120,
    "]": 121,
    "ʼ": 122,
    "м": 123,
    "á": 124,
    "TS": 125,
    "Ts": 126,
    "д": 127,
    "Sh": 128,
    "Vo": 129,
    "SH": 130,
    "я": 131,
    "%": 132,
    "й": 133,
    "ǀ": 134,
    "у": 135,
    "é": 136,
    "п": 137,
    "Th": 138,
    "ó": 139,
    "TH": 140,
    "г": 141,
    "ā": 142,
    "?": 143,
    "Ʞ": 144,
    "$": 145,
    "ы": 146,
    "ǂ": 147,
    "М": 148,
    "ь": 149,
    "í": 150,
    "ч": 151,
    "’": 152,
    "б": 153,
    "Ch": 154,
    "з": 155,
    "CH": 156,
    "^": 157,
    "DJ": 158,
    "Dj": 159,
    "à": 160,
    "”": 161,
    "С": 162,
    "ō": 163,
    "“": 164,
    "*": 165,
    "֊": 166,
    "х": 167,
    "ц": 168,
    "А": 169,
    "¡": 170,
    "GH": 171,
    "ì": 172,
    "ú": 173,
    "Gh": 174,
    "К": 175,
    "õ": 176,
    "⟩": 177,
    "ū": 178,
    "ǎ": 179,
    "錢": 180,
    "<": 181,
    "⟨": 182,
    "ф": 183,
    "ǁ": 184,
    "В": 185,
    "KH": 186,
    "П": 187,
    "钱": 188,
    ">": 189,
    "ü": 190,
    "И": 191,
    "ö": 192,
    "Kh": 193,
    "О": 194,
    "#": 195,
    "ò": 196,
    "Н": 197,
    "ш": 198,
    "Б": 199,
    "寶": 200,
    "−": 201,
    "ù": 202,
    "|": 203,
    "α": 204,
    "Д": 205,
    "Г": 206,
    "ж": 207,
    "ŋ": 208,
    "è": 209,
    "э": 210,
    "ZH": 211,
    "ʰ": 212,
    "Р": 213,
    "ː": 214,
    "Zh": 215,
    "通": 216,
    "â": 217,
    "ũ": 218,
    "ǐ": 219,
    "Л": 220,
    "ī": 221,
    "ー": 222,
    "Т": 223,
    "ا": 224,
    "…": 225,
    "ǔ": 226,
    "͡": 227,
    "ю": 228,
    "Ф": 229,
    "ン": 230,
    "Х": 231,
    "Э": 232,
    "ɲ": 233,
    "子": 234,
    "ã": 235,
    "†": 236,
    "平": 237,
    "‎": 238,
    "ệ": 239,
    "ل": 240,
    "~": 241,
    "У": 242,
    "Е": 243,
    "β": 244,
    "品": 245,
    "ă": 246,
    "文": 247,
    "ο": 248,
    "ε": 249,
    "×": 250,
    "ʘ": 251,
    "‘": 252,
    "χ": 253,
    "і": 254,
    "ʔ": 255,
    "・": 256,
    "→": 257,
    "ˀ": 258,
    "щ": 259,
    "ē": 260,
    "№": 261,
    "花": 262,
    "​": 263,
    "π": 264,
    "ι": 265,
    "壽": 266,
    "ク": 267,
    "太": 268,
    "τ": 269,
    "½": 270,
    "明": 271,
    "福": 272,
    "ب": 273,
    "ñ": 274,
    "م": 275,
    "天": 276,
    "Я": 277,
    "ρ": 278,
    "五": 279,
    "中": 280,
    "牌": 281,
    "ن": 282,
    "З": 283,
    "ν": 284,
    "大": 285,
    "四": 286,
    "ი": 287,
    "ر": 288,
    "ع": 289,
    "σ": 290,
    "κ": 291,
    "ί": 292,
    "ɔ": 293,
    "ô": 294,
    "ა": 295,
    "ˈ": 296,
    "形": 297,
    "ッ": 298,
    "ス": 299,
    "و": 300,
    "ς": 301,
    "DZ": 302,
    "光": 303,
    "Tch": 304,
    "Dz": 305,
    "人": 306,
    "二": 307,
    "Ш": 308,
    "貴": 309,
    "下": 310,
    "±": 311,
    "λ": 312,
    "ə": 313,
    "ä": 314,
    "§": 315,
    "金": 316,
    "祥": 317,
    "十": 318,
    "ᵑ": 319,
    "د": 320,
    "̰": 321,
    "²": 322,
    "童": 323,
    "ე": 324,
    "˦": 325,
    "蘭": 326,
    "空": 327,
    "ト": 328,
    "イ": 329,
    "˧": 330,
    "ʾ": 331,
    "ș": 332,
    "ê": 333,
    "長": 334,
    "當": 335,
    "吉": 336,
    "佛": 337,
    "̃": 338,
    "ł": 339,
    "Á": 340,
    "雷": 341,
    "挂": 342,
    "幣": 343,
    "ي": 344,
    "Ч": 345,
    "γ": 346,
    "ë": 347,
    "萬": 348,
    "胜": 349,
    "ラ": 350,
    "η": 351,
    "ś": 352,
    "重": 353,
    "百": 354,
    "康": 355,
    "女": 356,
    "ル": 357,
    "ア": 358,
    "の": 359,
    "δ": 360,
    "̊": 361,
    "符": 362,
    "神": 363,
    "熙": 364,
    "意": 365,
    "安": 366,
    "千": 367,
    "シ": 368,
    "↑": 369,
    "•": 370,
    "―": 371,
    "̦": 372,
    "ơ": 373,
    "¿": 374,
    "道": 375,
    "布": 376,
    "字": 377,
    "压": 378,
    "冥": 379,
    "リ": 380,
    "ё": 381,
    "Ю": 382,
    "υ": 383,
    "ʃ": 384,
    "ş": 385,
    "豐": 386,
    "緒": 387,
    "泰": 388,
    "八": 389,
    "ロ": 390,
    "ї": 391,
    "ɡ": 392,
    "連": 393,
    "我": 394,
    "富": 395,
    "代": 396,
    "ド": 397,
    "μ": 398,
    "·": 399,
    "­": 400,
    "生": 401,
    "フ": 402,
    "⁄": 403,
    "س": 404,
    "Ц": 405,
    "Δ": 406,
    "ɪ": 407,
    "Đ": 408,
    "æ": 409,
    "打": 410,
    "他": 411,
    "≈": 412,
    "„": 413,
    "ح": 414,
    "ɢ": 415,
    "Ā": 416,
    "ý": 417,
    "£": 418,
    "阿": 419,
    "避": 420,
    "織": 421,
    "火": 422,
    "桂": 423,
    "教": 424,
    "掛": 425,
    "國": 426,
    "和": 427,
    "命": 428,
    "九": 429,
    "マ": 430,
    "チ": 431,
    "タ": 432,
    "キ": 433,
    "↓": 434,
    "ლ": 435,
    "ی": 436,
    "ت": 437,
    "û": 438,
    "華": 439,
    "秘": 440,
    "孝": 441,
    "ィ": 442,
    "ễ": 443,
    "ע": 444,
    "ό": 445,
    "ά": 446,
    "ɾ": 447,
    "ç": 448,
    "魚": 449,
    "音": 450,
    "陀": 451,
    "貨": 452,
    "胡": 453,
    "耕": 454,
    "歲": 455,
    "樹": 456,
    "書": 457,
    "彌": 458,
    "寓": 459,
    "仵": 460,
    "プ": 461,
    "ダ": 462,
    "‼": 463,
    "ו": 464,
    "ʒ": 465,
    "象": 466,
    "石": 467,
    "敢": 468,
    "家": 469,
    "壓": 470,
    "厌": 471,
    "仙": 472,
    "ẽ": 473,
    "რ": 474,
    "ო": 475,
    "أ": 476,
    "ל": 477,
    "ʗ": 478,
    "č": 479,
    "马": 480,
    "镂": 481,
    "芝": 482,
    "年": 483,
    "デ": 484,
    "ジ": 485,
    "サ": 486,
    "€": 487,
    "ნ": 488,
    "გ": 489,
    "ة": 490,
    "ר": 491,
    "θ": 492,
    "έ": 493,
    "ț": 494,
    "š": 495,
    "邪": 496,
    "葫": 497,
    "舞": 498,
    "無": 499,
    "武": 500,
    "景": 501,
    "土": 502,
    "国": 503,
    "周": 504,
    "南": 505,
    "元": 506,
    "レ": 507,
    "ュ": 508,
    "᥄": 509,
    "ᠣ": 510,
    "ვ": 511,
    "˥": 512,
    "꞉": 513,
    "馗": 514,
    "飾": 515,
    "鍾": 516,
    "行": 517,
    "皇": 518,
    "玉": 519,
    "桃": 520,
    "格": 521,
    "孫": 522,
    "季": 523,
    "夫": 524,
    "合": 525,
    "古": 526,
    "令": 527,
    "为": 528,
    "上": 529,
    "ョ": 530,
    "ウ": 531,
    "ん": 532,
    "≠": 533,
    "‽": 534,
    "ه": 535,
    "ق": 536,
    "ف": 537,
    "א": 538,
    "Ж": 539,
    "Ν": 540,
    "ǒ": 541,
    "ě": 542,
    "ð": 543,
    "Ä": 544,
    "黃": 545,
    "鳳": 546,
    "驅": 547,
    "霆": 548,
    "降": 549,
    "谐": 550,
    "藏": 551,
    "的": 552,
    "瘦": 553,
    "男": 554,
    "民": 555,
    "毒": 556,
    "正": 557,
    "棄": 558,
    "春": 559,
    "戏": 560,
    "德": 561,
    "回": 562,
    "咸": 563,
    "入": 564,
    "余": 565,
    "且": 566,
    "ム": 567,
    "コ": 568,
    "∞": 569,
    "′": 570,
    "˩": 571,
    "ʲ": 572,
    "ɟ": 573,
    "鯉": 574,
    "風": 575,
    "陶": 576,
    "鎖": 577,
    "銖": 578,
    "辟": 579,
    "莫": 580,
    "與": 581,
    "秋": 582,
    "禦": 583,
    "田": 584,
    "海": 585,
    "楚": 586,
    "朝": 587,
    "日": 588,
    "押": 589,
    "影": 590,
    "圖": 591,
    "兵": 592,
    "伎": 593,
    "ワ": 594,
    "ビ": 595,
    "エ": 596,
    "ァ": 597,
    "∈": 598,
    "ṡ": 599,
    "َ": 600,
    "ك": 601,
    "ص": 602,
    "ش": 603,
    "خ": 604,
    "ת": 605,
    "ש": 606,
    "י": 607,
    "Γ": 608,
    "̞": 609,
    "ư": 610,
    "Ř": 611,
    "ı": 612,
    "ğ": 613,
    "ę": 614,
    "¼": 615,
    "³": 616,
    "，": 617,
    "馬": 618,
    "詩": 619,
    "稱": 620,
    "物": 621,
    "洪": 622,
    "松": 623,
    "時": 624,
    "山": 625,
    "如": 626,
    "城": 627,
    "博": 628,
    "勝": 629,
    "ャ": 630,
    "グ": 631,
    "っ": 632,
    "ả": 633,
    "ᤚ": 634,
    "ძ": 635,
    "̂": 636,
    "ɛ": 637,
    "ɑ": 638,
    "ß": 639,
    "龍": 640,
    "鎮": 641,
    "親": 642,
    "虫": 643,
    "藍": 644,
    "絲": 645,
    "津": 646,
    "洞": 647,
    "河": 648,
    "庫": 649,
    "宮": 650,
    "官": 651,
    "君": 652,
    "做": 653,
    "俗": 654,
    "事": 655,
    "モ": 656,
    "ベ": 657,
    "パ": 658,
    "ゾ": 659,
    "ズ": 660,
    "オ": 661,
    "∓": 662,
    "›": 663,
    "‹": 664,
    "‡": 665,
    "ầ": 666,
    "ს": 667,
    "დ": 668,
    "ز": 669,
    "ה": 670,
    "Ә": 671,
    "ъ": 672,
    "І": 673,
    "ω": 674,
    "φ": 675,
    "́": 676,
    "ʻ": 677,
    "ʌ": 678,
    "ʊ": 679,
    "ő": 680,
    "ĩ": 681,
    "©": 682,
    "¢": 683,
    "陽": 684,
    "阴": 685,
    "闇": 686,
    "镇": 687,
    "起": 688,
    "財": 689,
    "语": 690,
    "說": 691,
    "蓝": 692,
    "节": 693,
    "罵": 694,
    "篆": 695,
    "笑": 696,
    "祺": 697,
    "看": 698,
    "瘞": 699,
    "瘗": 700,
    "疊": 701,
    "玲": 702,
    "玩": 703,
    "王": 704,
    "父": 705,
    "煥": 706,
    "為": 707,
    "水": 708,
    "歷": 709,
    "月": 710,
    "星": 711,
    "散": 712,
    "敕": 713,
    "捧": 714,
    "戲": 715,
    "慶": 716,
    "愛": 717,
    "忠": 718,
    "延": 719,
    "库": 720,
    "寿": 721,
    "寅": 722,
    "容": 723,
    "婦": 724,
    "套": 725,
    "器": 726,
    "叠": 727,
    "厭": 728,
    "原": 729,
    "卦": 730,
    "制": 731,
    "之": 732,
    "七": 733,
    "ミ": 734,
    "ニ": 735,
    "テ": 736,
    "ゲ": 737,
    "カ": 738,
    "あ": 739,
    "」": 740,
    "「": 741,
    "ᤐ": 742,
    "ᠪ": 743,
    "შ": 744,
    "კ": 745,
    "თ": 746,
    "ბ": 747,
    "ک": 748,
    "є": 749,
    "ξ": 750,
    "ζ": 751,
    "ή": 752,
    "Σ": 753,
    "Μ": 754,
    "̩": 755,
    "ů": 756,
    "ř": 757,
    "Ō": 758,
    "ą": 759,
    "´": 760,
    "｣": 761,
    "｢": 762,
    "이": 763,
    "다": 764,
    "나": 765,
    "鸟": 766,
    "鱼": 767,
    "魔": 768,
    "騰": 769,
    "馆": 770,
    "饰": 771,
    "雪": 772,
    "雜": 773,
    "雙": 774,
    "雍": 775,
    "隆": 776,
    "陳": 777,
    "陰": 778,
    "锁": 779,
    "鏤": 780,
    "野": 781,
    "郢": 782,
    "遣": 783,
    "连": 784,
    "輪": 785,
    "輝": 786,
    "護": 787,
    "諧": 788,
    "言": 789,
    "觀": 790,
    "蠶": 791,
    "蟲": 792,
    "蛟": 793,
    "萼": 794,
    "芦": 795,
    "臣": 796,
    "腑": 797,
    "肺": 798,
    "聚": 799,
    "義": 800,
    "罗": 801,
    "织": 802,
    "科": 803,
    "祜": 804,
    "眼": 805,
    "盘": 806,
    "盆": 807,
    "異": 808,
    "界": 809,
    "煞": 810,
    "泥": 811,
    "泉": 812,
    "死": 813,
    "樣": 814,
    "樂": 815,
    "树": 816,
    "时": 817,
    "摇": 818,
    "搖": 819,
    "慈": 820,
    "帝": 821,
    "币": 822,
    "州": 823,
    "寧": 824,
    "宫": 825,
    "宝": 826,
    "妇": 827,
    "好": 828,
    "夀": 829,
    "呈": 830,
    "午": 831,
    "前": 832,
    "利": 833,
    "出": 834,
    "兩": 835,
    "倫": 836,
    "倍": 837,
    "乾": 838,
    "也": 839,
    "世": 840,
    "ブ": 841,
    "バ": 842,
    "ソ": 843,
    "ゴ": 844,
    "た": 845,
    "か": 846,
    "。": 847,
    "≥": 848,
    "≤": 849,
    "ἀ": 850,
    "ụ": 851,
    "უ": 852,
    "य": 853,
    "ٌ": 854,
    "ض": 855,
    "ώ": 856,
    "Α": 857,
    "ʁ": 858,
    "É": 859,
    "！": 860,
    "﹗": 861,
    "鳥": 862,
    "香": 863,
    "靈": 864,
    "除": 865,
    "阳": 866,
    "邴": 867,
    "蚩": 868,
    "蘆": 869,
    "統": 870,
    "笮": 871,
    "相": 872,
    "琮": 873,
    "珑": 874,
    "玄": 875,
    "爰": 876,
    "毋": 877,
    "榮": 878,
    "案": 879,
    "杂": 880,
    "方": 881,
    "拜": 882,
    "忘": 883,
    "异": 884,
    "尤": 885,
    "宜": 886,
    "學": 887,
    "孚": 888,
    "央": 889,
    "地": 890,
    "囯": 891,
    "名": 892,
    "同": 893,
    "去": 894,
    "华": 895,
    "卍": 896,
    "化": 897,
    "凹": 898,
    "凶": 899,
    "兄": 900,
    "儀": 901,
    "傳": 902,
    "作": 903,
    "佑": 904,
    "今": 905,
    "书": 906,
    "乐": 907,
    "三": 908,
    "ハ": 909,
    "ナ": 910,
    "セ": 911,
    "ケ": 912,
    "ひ": 913,
    "じ": 914,
    "げ": 915,
    "い": 916,
    "〜": 917,
    "《": 918,
    "⩲": 919,
    "⩱": 920,
    "○": 921,
    "□": 922,
    "⊕": 923,
    "‱": 924,
    "‚": 925,
    "ữ": 926,
    "Ḷ": 927,
    "ᶢ": 928,
    "ᤦ": 929,
    "ᤥ": 930,
    "ᤌ": 931,
    "ᤄ": 932,
    "ᤂ": 933,
    "ფ": 934,
    "მ": 935,
    "پ": 936,
    "ْ": 937,
    "ى": 938,
    "כ": 939,
    "ד": 940,
    "ּ": 941,
    "ָ": 942,
    "ַ": 943,
    "ְ": 944,
    "ұ": 945,
    "Й": 946,
    "ύ": 947,
    "ˌ": 948,
    "ʕ": 949,
    "ǚ": 950,
    "ń": 951,
    "ć": 952,
    "Ü": 953,
    "Õ": 954,
    "Ç": 955,
    "Æ": 956,
    "Ｚ": 957,
    "Ｖ": 958,
    "Ｔ": 959,
    "７": 960,
    "）": 961,
    "（": 962,
    "＆": 963,
    "사": 964,
    "뛴": 965,
    "黒": 966,
    "鬥": 967,
    "餅": 968,
    "震": 969,
    "陛": 970,
    "郎": 971,
    "進": 972,
    "轉": 973,
    "質": 974,
    "诗": 975,
    "紀": 976,
    "第": 977,
    "禎": 978,
    "社": 979,
    "版": 980,
    "潮": 981,
    "桐": 982,
    "株": 983,
    "木": 984,
    "敬": 985,
    "招": 986,
    "才": 987,
    "手": 988,
    "式": 989,
    "師": 990,
    "川": 991,
    "崇": 992,
    "局": 993,
    "宇": 994,
    "士": 995,
    "場": 996,
    "口": 997,
    "北": 998,
    "劇": 999,
    "内": 1000,
    "共": 1001,
    "先": 1002,
    "会": 1003,
    "丁": 1004,
    "ホ": 1005,
    "ツ": 1006,
    "ォ": 1007,
    "ゃ": 1008,
    "ま": 1009,
    "し": 1010,
    "さ": 1011,
    "け": 1012,
    "》": 1013,
    "⸘": 1014,
    "⌓": 1015,
    "∇": 1016,
    "↻": 1017,
    "⁉": 1018,
    "⁈": 1019,
    "‰": 1020,
    "ử": 1021,
    "ợ": 1022,
    "ọ": 1023,
    "ế": 1024,
    "ṅ": 1025,
    "ყ": 1026,
    "ტ": 1027,
    "ِ": 1028,
    "غ": 1029,
    "ط": 1030,
    "ئ": 1031,
    "إ": 1032,
    "ء": 1033,
    "צ": 1034,
    "מ": 1035,
    "ב": 1036,
    "ׁ": 1037,
    "ֹ": 1038,
    "ա": 1039,
    "ү": 1040,
    "ј": 1041,
    "Ы": 1042,
    "Є": 1043,
    "Ω": 1044,
    "̝": 1045,
    "ˤ": 1046,
    "ˋ": 1047,
    "ʟ": 1048,
    "ɹ": 1049,
    "Š": 1050,
    "đ": 1051,
    "î": 1052,
    "Ó": 1053,
    "µ": 1054,
    "～": 1055,
    "：": 1056,
    "０": 1057,
    "하": 1058,
    "의": 1059,
    "은": 1060,
    "시": 1061,
    "스": 1062,
    "브": 1063,
    "랑": 1064,
    "라": 1065,
    "들": 1066,
    "더": 1067,
    "놈": 1068,
    "김": 1069,
    "게": 1070,
    "가": 1071,
    "ꜞ": 1072,
    "館": 1073,
    "面": 1074,
    "静": 1075,
    "銅": 1076,
    "邸": 1077,
    "遊": 1078,
    "迷": 1079,
    "辛": 1080,
    "車": 1081,
    "賊": 1082,
    "谷": 1083,
    "谢": 1084,
    "謝": 1085,
    "術": 1086,
    "蜘": 1087,
    "蛛": 1088,
    "藤": 1089,
    "英": 1090,
    "良": 1091,
    "者": 1092,
    "瓏": 1093,
    "理": 1094,
    "獏": 1095,
    "爆": 1096,
    "炮": 1097,
    "浜": 1098,
    "此": 1099,
    "本": 1100,
    "戯": 1101,
    "您": 1102,
    "御": 1103,
    "弾": 1104,
    "市": 1105,
    "巴": 1106,
    "島": 1107,
    "岡": 1108,
    "報": 1109,
    "執": 1110,
    "在": 1111,
    "吾": 1112,
    "台": 1113,
    "卒": 1114,
    "勢": 1115,
    "們": 1116,
    "伽": 1117,
    "仮": 1118,
    "井": 1119,
    "一": 1120,
    "ヤ": 1121,
    "メ": 1122,
    "ポ": 1123,
    "ボ": 1124,
    "ピ": 1125,
    "ガ": 1126,
    "ェ": 1127,
    "り": 1128,
    "く": 1129,
    "❣": 1130,
    "❗": 1131,
    "⚠": 1132,
    "▢": 1133,
    "⋅": 1134,
    "≡": 1135,
    "⇧": 1136,
    "Ⅳ": 1137,
    "₂": 1138,
    "″": 1139,
    "ῶ": 1140,
    "ὴ": 1141,
    "ἐ": 1142,
    "ỹ": 1143,
    "ạ": 1144,
    "ṭ": 1145,
    "ḕ": 1146,
    "ᵡ": 1147,
    "ᤨ": 1148,
    "ᤤ": 1149,
    "ᤢ": 1150,
    "ᤛ": 1151,
    "ᤙ": 1152,
    "ᤘ": 1153,
    "ᤗ": 1154,
    "ᤖ": 1155,
    "ᤔ": 1156,
    "ᤑ": 1157,
    "ᤊ": 1158,
    "ᤇ": 1159,
    "ᤆ": 1160,
    "ᤅ": 1161,
    "ᤃ": 1162,
    "ჯ": 1163,
    "წ": 1164,
    "ზ": 1165,
    "ा": 1166,
    "च": 1167,
    "ّ": 1168,
    "פ": 1169,
    "נ": 1170,
    "ט": 1171,
    "ג": 1172,
    "ֶ": 1173,
    "ִ": 1174,
    "ր": 1175,
    "վ": 1176,
    "ե": 1177,
    "ѣ": 1178,
    "њ": 1179,
    "Ї": 1180,
    "Χ": 1181,
    "Τ": 1182,
    "Π": 1183,
    "Ο": 1184,
    "Β": 1185,
    "̀": 1186,
    "˙": 1187,
    "ɒ": 1188,
    "Ə": 1189,
    "ż": 1190,
    "Ł": 1191,
    "ħ": 1192,
    "þ": 1193,
    "÷": 1194,
    "Ø": 1195,
    "Ñ": 1196,
    "Å": 1197,
    "¥": 1198,
    "🕴": 1199,
    "💎": 1200,
    "👑": 1201,
    "Ｗ": 1202,
    "Ｒ": 1203,
    "Ｐ": 1204,
    "Ｍ": 1205,
    "Ｊ": 1206,
    "Ｇ": 1207,
    "Ｅ": 1208,
    "Ｄ": 1209,
    "１": 1210,
    "．": 1211,
    "훈": 1212,
    "환": 1213,
    "현": 1214,
    "한": 1215,
    "피": 1216,
    "프": 1217,
    "퍼": 1218,
    "틴": 1219,
    "티": 1220,
    "특": 1221,
    "퇴": 1222,
    "키": 1223,
    "친": 1224,
    "창": 1225,
    "찬": 1226,
    "짓": 1227,
    "지": 1228,
    "종": 1229,
    "조": 1230,
    "점": 1231,
    "자": 1232,
    "우": 1233,
    "용": 1234,
    "왕": 1235,
    "여": 1236,
    "앤": 1237,
    "아": 1238,
    "싸": 1239,
    "셔": 1240,
    "상": 1241,
    "쁜": 1242,
    "부": 1243,
    "봐": 1244,
    "별": 1245,
    "범": 1246,
    "반": 1247,
    "미": 1248,
    "문": 1249,
    "록": 1250,
    "로": 1251,
    "람": 1252,
    "떴": 1253,
    "드": 1254,
    "눈": 1255,
    "내": 1256,
    "길": 1257,
    "기": 1258,
    "근": 1259,
    "국": 1260,
    "과": 1261,
    "같": 1262,
    "ꜟ": 1263,
    "ꜝ": 1264,
    "黄": 1265,
    "鷹": 1266,
    "鶴": 1267,
    "鴻": 1268,
    "鯨": 1269,
    "髪": 1270,
    "騒": 1271,
    "首": 1272,
    "頭": 1273,
    "青": 1274,
    "集": 1275,
    "雀": 1276,
    "闘": 1277,
    "閆": 1278,
    "門": 1279,
    "钧": 1280,
    "錠": 1281,
    "鉴": 1282,
    "鈴": 1283,
    "鈞": 1284,
    "里": 1285,
    "配": 1286,
    "部": 1287,
    "遠": 1288,
    "退": 1289,
    "軍": 1290,
    "路": 1291,
    "足": 1292,
    "赤": 1293,
    "謎": 1294,
    "諮": 1295,
    "詢": 1296,
    "計": 1297,
    "見": 1298,
    "覇": 1299,
    "西": 1300,
    "裸": 1301,
    "蝶": 1302,
    "蛾": 1303,
    "蛭": 1304,
    "蛇": 1305,
    "蔵": 1306,
    "萩": 1307,
    "菜": 1308,
    "菁": 1309,
    "自": 1310,
    "耀": 1311,
    "翔": 1312,
    "羽": 1313,
    "美": 1314,
    "続": 1315,
    "竜": 1316,
    "秦": 1317,
    "秤": 1318,
    "矢": 1319,
    "真": 1320,
    "目": 1321,
    "盤": 1322,
    "白": 1323,
    "畢": 1324,
    "甫": 1325,
    "產": 1326,
    "猿": 1327,
    "猪": 1328,
    "烈": 1329,
    "点": 1330,
    "炳": 1331,
    "灰": 1332,
    "灣": 1333,
    "瀬": 1334,
    "漁": 1335,
    "湾": 1336,
    "港": 1337,
    "渡": 1338,
    "洋": 1339,
    "沖": 1340,
    "決": 1341,
    "汶": 1342,
    "江": 1343,
    "永": 1344,
    "気": 1345,
    "殿": 1346,
    "業": 1347,
    "森": 1348,
    "棒": 1349,
    "梶": 1350,
    "梅": 1351,
    "梁": 1352,
    "桜": 1353,
    "根": 1354,
    "栞": 1355,
    "東": 1356,
    "村": 1357,
    "李": 1358,
    "札": 1359,
    "有": 1360,
    "會": 1361,
    "暴": 1362,
    "映": 1363,
    "早": 1364,
    "料": 1365,
    "敏": 1366,
    "支": 1367,
    "振": 1368,
    "承": 1369,
    "戴": 1370,
    "懷": 1371,
    "想": 1372,
    "情": 1373,
    "念": 1374,
    "志": 1375,
    "徐": 1376,
    "彦": 1377,
    "彥": 1378,
    "弟": 1379,
    "度": 1380,
    "幻": 1381,
    "己": 1382,
    "崎": 1383,
    "寺": 1384,
    "完": 1385,
    "守": 1386,
    "学": 1387,
    "孤": 1388,
    "孔": 1389,
    "姫": 1390,
    "姆": 1391,
    "外": 1392,
    "声": 1393,
    "坂": 1394,
    "团": 1395,
    "囚": 1396,
    "哥": 1397,
    "司": 1398,
    "号": 1399,
    "句": 1400,
    "双": 1401,
    "医": 1402,
    "匠": 1403,
    "势": 1404,
    "剛": 1405,
    "刈": 1406,
    "切": 1407,
    "冉": 1408,
    "円": 1409,
    "六": 1410,
    "公": 1411,
    "全": 1412,
    "児": 1413,
    "克": 1414,
    "優": 1415,
    "候": 1416,
    "侠": 1417,
    "体": 1418,
    "似": 1419,
    "了": 1420,
    "万": 1421,
    "ヴ": 1422,
    "ペ": 1423,
    "ヒ": 1424,
    "ノ": 1425,
    "ネ": 1426,
    "ヌ": 1427,
    "ゼ": 1428,
    "ザ": 1429,
    "も": 1430,
    "め": 1431,
    "ぱ": 1432,
    "は": 1433,
    "ね": 1434,
    "で": 1435,
    "せ": 1436,
    "が": 1437,
    "え": 1438,
    "う": 1439,
    "⸼": 1440,
    "⸮": 1441,
    "⨎": 1442,
    "❢": 1443,
    "❕": 1444,
    "✌": 1445,
    "♯": 1446,
    "⌘": 1447,
    "⊚": 1448,
    "∙": 1449,
    "∗": 1450,
    "∅": 1451,
    "⇄": 1452,
    "↵": 1453,
    "℗": 1454,
    "℃": 1455,
    "₥": 1456,
    "₉": 1457,
    "₅": 1458,
    "₄": 1459,
    "₁": 1460,
    "⁡": 1461,
    "‛": 1462,
    "‑": 1463,
    "ὸ": 1464,
    "ὁ": 1465,
    "ἕ": 1466,
    "ỳ": 1467,
    "ứ": 1468,
    "ớ": 1469,
    "ỗ": 1470,
    "ố": 1471,
    "ị": 1472,
    "ắ": 1473,
    "ậ": 1474,
    "ṹ": 1475,
    "ṇ": 1476,
    "ḿ": 1477,
    "ḥ": 1478,
    "ḍ": 1479,
    "።": 1480,
    "ხ": 1481,
    "ჭ": 1482,
    "ჟ": 1483,
    "႟": 1484,
    "෴": 1485,
    "।": 1486,
    "्": 1487,
    "ो": 1488,
    "े": 1489,
    "ू": 1490,
    "न": 1491,
    "द": 1492,
    "ण": 1493,
    "ड": 1494,
    "झ": 1495,
    "ख": 1496,
    "ऊ": 1497,
    "ं": 1498,
    "߹": 1499,
    "۔": 1500,
    "گ": 1501,
    "٫": 1502,
    "ٔ": 1503,
    "ُ": 1504,
    "ظ": 1505,
    "ذ": 1506,
    "ج": 1507,
    "ث": 1508,
    "ף": 1509,
    "ס": 1510,
    "ם": 1511,
    "ח": 1512,
    "ז": 1513,
    "ֵ": 1514,
    "։": 1515,
    "տ": 1516,
    "ջ": 1517,
    "մ": 1518,
    "կ": 1519,
    "ի": 1520,
    "՜": 1521,
    "Ա": 1522,
    "ә": 1523,
    "ґ": 1524,
    "Ґ": 1525,
    "ћ": 1526,
    "Щ": 1527,
    "Ѐ": 1528,
    "Ϩ": 1529,
    "ϕ": 1530,
    "Λ": 1531,
    "Κ": 1532,
    "Θ": 1533,
    "Η": 1534,
    "Ζ": 1535,
    "Ή": 1536,
    "̬": 1537,
    "ˑ": 1538,
    "ʷ": 1539,
    "ɦ": 1540,
    "ɣ": 1541,
    "ɐ": 1542,
    "Ȝ": 1543,
    "ǫ": 1544,
    "ź": 1545,
    "ű": 1546,
    "Ű": 1547,
    "Ũ": 1548,
    "Œ": 1549,
    "Ő": 1550,
    "İ": 1551,
    "ÿ": 1552,
    "ø": 1553,
    "ï": 1554,
    "å": 1555,
    "Ö": 1556,
    "Í": 1557,
    "Ã": 1558,
    "Â": 1559,
    "¾": 1560,
    "®": 1561
}